[
  {
    "id": "0",
    "title": "G00",
    "name": "Ускоренное перемещение инструмента (холостой ход)",
    "description": "<p>Функция G00 используется для выполнения ускоренного перемещения режущего инструмента к позиции обработки или к безопасной позиции. Ускоренное перемещение никогда не используется для выполнения обработки, так как скорость движения исполнительного органа станка очень высока. </p><p>Код G00 отменяется кодами: G01, G02, G03. </p>",
    "example": "G0 X0 Y0 Z100;"
  },
  {
    "id": "1",
    "title": "G01",
    "name": "Линейная интерполяция",
    "description": "Функция G01 используется для выполнения прямолинейных перемещений с заданной скоростью (F). <p>При программировании задаются координаты конечной точки в абсолютных значениях (G90) или приращениях (G91) с соответственными адресами перемещений (например X, Y, Z). <p>Код G01 отменяется кодами: G00, G02, G03.</p> <p><img src='img/pages/g1.jpg' class='responsive'> </p>",
    "example": "G01 X0. Y0. Z100. F200;"
  },
  {
    "id": "2",
    "title": "G02",
    "name": "Круговая интерполяция по часовой стрелке",
    "description": "<p>Функция GO2 предназначена для выполнения перемещения инструмента по дуге (окружности) в направлении часовой стрелки с заданной скоростью (F). При программировании задаются координаты конечной точки в абсолютных значениях (G90) или приращениях (G91) с соответственными адресами перемещений (например X, Y, Z).</p><p>Параметры интерполяции I, J, K, которые определяют координаты центра дуги окружности в выбранной плоскости, программируются в приращениях от начальной точки к центру окружности, в направлениях, параллельных осям X, Y, Z соответственно.</p><p>Код G02 отменяется кодами: G00, G01, G03.</p>",
    "example": "G02 X15 Y15 R5 F200;"
  },
  {
    "id": "3",
    "title": "G03",
    "name": "Круговая интерполяция против часовой стрелки",
    "description": "<p>Функция GO3 предназначена для выполнения перемещения инструмента по дуге (окружности) в направлении против часовой стрелки с заданной скоростью (F). При программировании задаются координаты конечной точки в абсолютных значениях (G90) или приращениях (G91) с соответственными адресами перемещений (например X, Y, Z).</p><p> Параметры интерполяции I, J, K, которые определяют координаты центра дуги окружности в выбранной плоскости, программируются в приращениях от начальной точки к центру окружности, в направлениях, параллельных осям X, Y, Z соответственно.</p><p>Код G03 отменяется кодами: G00, G01, G02.</p>",
    "example": "G03 X15 Y15 R5 F200;"
  },
  {
    "id": "4",
    "title": "G04",
    "name": "Выдержка времени",
    "description": "Функция G04 - команда на выполнение выдержки с заданным временем. Этот код программируется вместе с X или Р адресом, который указывает длительность времени выдержки. Обычно, это время составляет от 0.001 до 99999.999 секунд. <p>Например G04 X2.5 - пауза 2.5 секунды, G04 Р1000 - пауза 1 секунда.</p>",
    "example": "G04 P500;"
  },
  {
    "id": "9",
    "title": "G09",
    "name": "Точный останов",
    "description": "Точный останов (по кадрам)",
    "example": ""
  },
  {
    "id": "10",
    "title": "G10",
    "name": "Новые координаты",
    "description": "Задать новые координаты для начала координат",
    "example": "G10 X10 Y10 Z10;"
  },
  {
    "id": "11",
    "title": "G11",
    "name": "Отмена",
    "description": "Отмена",
    "example": "G11;"
  },
  {
    "id": "15",
    "title": "G15",
    "name": "Отмена",
    "description": "Отмена",
    "example": "G15 G90;"
  },
  {
    "id": "16",
    "title": "G16",
    "name": "Переключение в полярную систему координат\t",
    "description": "Переключение в полярную систему координат\t",
    "example": "G16 G91 X100 Y90;"
  },
  {
    "id": "17",
    "title": "G17 ",
    "name": "Выбор плоскости XY",
    "description": "Код G17 предназначен для выбора плоскости XY в качестве рабочей. Плоскость XY становится определяющей при использовании круговой интерполяции, вращении системы координат и постоянных циклов сверления.",
    "example": null
  },
  {
    "id": "18",
    "title": "G18 ",
    "name": "Выбор плоскости XZ",
    "description": "Код G18 предназначен для выбора плоскости XZ в качестве рабочей. Плоскость XZ становится определяющей при использовании круговой интерполяции, вращении системы координат и постоянных циклов сверления.",
    "example": null
  },
  {
    "id": "19",
    "title": "G19 ",
    "name": "Выбор плоскости YZ",
    "description": "Код G19 предназначен для выбора плоскости YZ в качестве рабочей. Плоскость YZ становится определяющей при использовании круговой интерполяции, вращении системы координат и постоянных циклов сверления.",
    "example": null
  },
  {
    "id": "20",
    "title": "G20",
    "name": "Режим работы в дюймовой системе",
    "description": "Функция G20 активизирует режим работы с дюймовыми данными.",
    "example": "G90 G20;"
  },
  {
    "id": "21",
    "title": "G21",
    "name": "Режим работы в метрической системе",
    "description": "Функция G21 активизирует режим работы с метрическими данными.",
    "example": "G90 G21;"
  },
  {
    "id": "22",
    "title": "G22",
    "name": "Активировать установленый предел перемещений",
    "description": "Активировать установленый предел перемещений (Станок не выйдет за их предел).",
    "example": "G22 G01 X15 Y25;"
  },
  {
    "id": "23",
    "title": "G23",
    "name": "Отмена G22",
    "description": "Отмена G22",
    "example": "G23 G90 G54;"
  },
  {
    "id": "25",
    "title": "G25",
    "name": "Минимальное ограничение рабочей зоны",
    "description": "Минимальное ограничение рабочей зоны",
    "example": "G25 XC=0 ZC=0 Z2C=0;"
  },
  {
    "id": "26",
    "title": "G26",
    "name": "Максимальное ограничение числа оборотов",
    "description": "Максимальное ограничение числа оборотов шпинделя",
    "example": "G26 S2000;"
  },
  {
    "id": "28",
    "title": "G28",
    "name": "Вернуться на референтную точку",
    "description": "Вернуться на референтную точку",
    "example": "G28 G91 U0 W0;"
  },
  {
    "id": "30",
    "title": "G30",
    "name": "Поднятие по оси Z на точку смены инструмента",
    "description": "Поднятие по оси Z на точку смены инструмента",
    "example": "G30 G91 Z0;"
  },
  {
    "id": "33",
    "title": "G33",
    "name": "Нарезание резьбы с постояным шагом",
    "description": "Нарезание резьбы с постояным шагом (с датчиком угловых перемещений)",
    "example": null
  },
  {
    "id": "34",
    "title": "G34",
    "name": "Нарезание резьбы с уменьшающимся шагом",
    "description": "Нарезание резьбы с уменьшающимся шагом",
    "example": null
  },
  {
    "id": "35",
    "title": "G35",
    "name": "Нарезание резьбы с увеличивающимся шагом",
    "description": "Нарезание резьбы с увеличивающимся шагом",
    "example": null
  },
  {
    "id": "40",
    "title": "G40 ",
    "name": "Отмена коррекции на радиус инструмента",
    "description": "Функция G40 отменяет действие автоматической коррекции на радиус инструмента G41 и G42.",
    "example": "G1 G40 X0 Y0 F200;"
  },
  {
    "id": "41",
    "title": "G41 ",
    "name": "Левая коррекция на радиус инструмента",
    "description": "Функция G41 применяется для включения автоматической коррекции на радиус инструмента находящегося слева от обрабатываемой поверхности (если смотреть от инструмента в направлении его движения относительно заготовки). <p>Программируется вместе с функцией инструмента (D).</p>",
    "example": "G41 X15 Y15 D1 F100;"
  },
  {
    "id": "42",
    "title": "G42",
    "name": "Правая коррекция на радиус инструмента",
    "description": "Функция G42 применяется для включения автоматической коррекции на радиус инструмента находящегося справа от обрабатываемой поверхности (если смотреть от инструмента в направлении его движения относительно заготовки). <p>Программируется вместе с функцией инструмента (D).<p>",
    "example": "G42 X15 Y15 D1 F100;"
  },
  {
    "id": "43",
    "title": "G43",
    "name": "Коррекция на положение инструмента",
    "description": "Функция G43 применяется для компенсации длинны инструмента. <p>Программируется вместе с функцией инструмента (H).</p>",
    "example": "G43 X15 Y15 Z100 H1 S1000 M3;"
  },
  {
    "id": "44",
    "title": "G44",
    "name": "Коррекция высоты инструмента отрицательно",
    "description": "Коррекция высоты инструмента отрицательно",
    "example": "G44 X15 Y15 Z4 H1 S1000 M3;"
  },
  {
    "id": "52",
    "title": "G52",
    "name": "Локальная система координат",
    "description": "СЧПУ позволяет устанавливать кроме стандартных рабочих систем координат (G54-G59) еще и локальные. Когда СЧПУ станка выполняет команду G52, то начало действующей рабочей системы координат смещается на значение указанное при помощи слов данных X, Y и Z. Код G52 автоматически отменяется с помощью команды G52 ХО YO Z0.",
    "example": null
  },
  {
    "id": "53",
    "title": "G53",
    "name": "Отмена смещения нулевой точки",
    "description": "Отмена смещения нулевой точки на координатной системе станка. Действует в покадровом режиме.",
    "example": null
  },
  {
    "id": "54",
    "title": "G54-G59",
    "name": "Переключиться на заданную систему координат",
    "description": "Смещение рабочей системы координат детали относительно системы координат станка.",
    "example": "G54 G0 X0 Y0 Z100;"
  },
  {
    "id": "60",
    "title": "G60",
    "name": "Режим точного останова",
    "description": "Режим точного останова. Модальная команда.",
    "example": null
  },
  {
    "id": "63",
    "title": "G63",
    "name": "Нарезание внутренней резьбы без синхронизации",
    "description": "Нарезание внутреней резьбы без синхронизации (с регулируемым резцедержателем - действует в кадровом режиме).",
    "example": null
  },
  {
    "id": "68",
    "title": "G68 ",
    "name": "Вращение координат",
    "description": "Код G68 позволяет выполнить поворот координатной системы на определенный угол. <p>Для выполнения поворота требуется указать плоскость вращения, центр вращения и угол поворота.</p><p>Плоскость вращения устанавливается при помощи кодов G17, G18 и G19.</p> <p>Центр вращения устанавливается относительно нулевой точки активной рабочей системы координат (G54 - G59). Угол вращения указывается при помощи R.</p>",
    "example": "G17 G68 X0. Y0. R120;"
  },
  {
    "id": "69",
    "title": "G69",
    "name": "Отмена вращения координат",
    "description": "Код G69 отменяет режим вращения координат G68.",
    "example": "G69;"
  },
  {
    "id": "70",
    "title": "G70",
    "name": "Система ввода в дюймах",
    "description": "Система ввода в дюймах",
    "example": null
  },
  {
    "id": "71",
    "title": "G71",
    "name": "Метрическая система ввода",
    "description": "Метрическая система ввода",
    "example": null
  },
  {
    "id": "73",
    "title": "G73",
    "name": "Высокоскоростной цикл прерывистого сверления",
    "description": "Цикл G73 предназначен для сверления отверстий. Движение в процессе обработки происходит на рабочей подаче с периодическим выводом инструмента. Движение в исходное положение после обработки идет на ускоренной подаче.",
    "example": null
  },
  {
    "id": "74",
    "title": "G74 ",
    "name": "Цикл нарезания левой резьбы",
    "description": "Цикл G74 предназначен для нарезания левой резьбы метчиком. Движение в процессе обработки происходит на рабочей подаче, шпиндель вращается в заданном направлении. Движение в исходное положение после обработки идет на рабочей подаче с обратным вращением шпинделя.",
    "example": null
  },
  {
    "id": "75",
    "title": "G75",
    "name": "Перемещение в фиксированое положение",
    "description": "Перемещение в фиксированое положение (точка смены инструмента)",
    "example": null
  },
  {
    "id": "80",
    "title": "G80",
    "name": "Отмена циклов сверления (G81-G84)\t",
    "description": "Функция, которая отменяет любой постоянный цикл.",
    "example": "G80 Z100;"
  },
  {
    "id": "81",
    "title": "G81",
    "name": "Стандартный цикл сверления",
    "description": "Цикл G81 предназначен для зацентровки и сверления отверстий. Движение в процессе обработки происходит на рабочей подаче. Движение в исходное положение после обработки идет на ускоренной подаче.",
    "example": "G81 X0 Y0 Z-10 R3 F100;"
  },
  {
    "id": "82",
    "title": "G82 ",
    "name": "Сверление с выдержкой",
    "description": "Цикл G82 предназначен для сверления и зенкования отверстий. Движение в процессе обработки происходит на рабочей подаче с паузой в конце. Движение в исходное положение после обработки идет на ускоренной подаче.",
    "example": "G82 X0 Y0 Z-10 R3 P100 F100;"
  },
  {
    "id": "83",
    "title": "G83",
    "name": "Цикл прерывистого сверления",
    "description": "Цикл G83 предназначен для глубокого сверления отверстий. Движение в процессе обработки происходит на рабочей подаче с периодическим выводом инструмента в плоскость отвода. Движение в исходное положение после обработки идет на ускоренной подаче.",
    "example": "G83 X0 Y0 Z-10 R3 Q8 F100;"
  },
  {
    "id": "84",
    "title": "G84 ",
    "name": "Цикл нарезания резьбы",
    "description": "Цикл G84 предназначен для нарезания резьбы метчиком. Движение в процессе обработки происходит на рабочей подаче, шпиндель вращается в заданном направлении. Движение в исходное положение после обработки идет на рабочей подаче с обратным вращением шпинделя.",
    "example": "G95 G84 X0 Y0 Z-10 R3 F1.411;"
  },
  {
    "id": "85",
    "title": "G85",
    "name": "Стандартный цикл растачивания",
    "description": "Цикл G85 предназначен для развертывания и растачивания отверстий. Движение в процессе обработки происходит на рабочей подаче. Движение в исходное положение после обработки идет на рабочей подаче.",
    "example": null
  },
  {
    "id": "86",
    "title": "G86 ",
    "name": "Цикл растачивания с остановкой вращения шпинделя",
    "description": "Цикл G86 предназначен для растачивания отверстий. Движение в процессе обработки происходит на рабочей подаче. В конце обработки происходит остановка шпинделя. Движение в исходное положение после обработки идет на ускоренной подаче.",
    "example": null
  },
  {
    "id": "87",
    "title": "G87 ",
    "name": "Цикл растачивания с отводом вручную",
    "description": "Цикл G87 предназначен для растачивания отверстий. Движение в процессе обработки происходит на рабочей подаче. В конце обработки происходит остановка шпинделя. Движение в исходное положение после обработки идет вручную.",
    "example": null
  },
  {
    "id": "90",
    "title": "G90 ",
    "name": "Абсолютная система координат",
    "description": "В режиме абсолютного позиционирования G90 перемещения исполнительных органов производятся относительно нулевой точки рабочей системы координат G54-G59 (программируется, куда должен двигаться инструмент). Код G90 отменяется при помощи кода относительного позиционирования G91.",
    "example": "G90 G21;"
  },
  {
    "id": "91",
    "title": "G91",
    "name": "Относительная система координат",
    "description": "В режиме относительного (инкрементального) позиционирования G91 за нулевое положение каждый раз принимается положение исполнительного органа, которое он занимал перед началом перемещения к следующей опорной точке (программируется, на сколько должен переместиться инструмент). Код G91 отменяется при помощи кода абсолютного позиционирования G90.",
    "example": "G91 G1 X4 Y5 F100;"
  },
  {
    "id": "94",
    "title": "G94 ",
    "name": "Скорость подачи в дюймах/миллиметрах в минуту",
    "description": "При помощи функции G94 указанная скорость подачи устанавливается в дюймах за 1 минуту (если действует функция G20) или в миллиметрах за 1 минуту (если действует функция G21). Программируется вместе с функцией подачи (F). Код G94 отменяется кодом G95.",
    "example": "G94 G80 Z100;"
  },
  {
    "id": "95",
    "title": "G95",
    "name": "Скорость подачи в дюймах/миллиметрах на оборот",
    "description": "При помощи функции G95 указанная скорость подачи устанавливается в дюймах на 1 оборот шпинделя (если действует функция G20) или в миллиметрах на 1 оборот шпинделя (если действует функция G21). Т.е. скорость подачи F синхронизируется со скоростью вращения шпинделя S. Код G95 отменяется кодом G94.",
    "example": "G95 G84 X0 Y0 Z-10 R3 F1.411;"
  },
  {
    "id": "96",
    "title": "G96",
    "name": "Постоянная скорость резания",
    "description": "Постоянная скорость резания",
    "example": null
  },
  {
    "id": "97",
    "title": "G97",
    "name": "Постоянное число оборотов",
    "description": "Постоянное число оборотов",
    "example": null
  },
  {
    "id": "98",
    "title": "G98",
    "name": "Возврат к исходной плоскости в цикле",
    "description": "Если постоянный цикл станка работает совместно с функцией G98, то инструмент возвращается к исходной плоскости в конце каждого цикла и между всеми обрабатываемыми отверстиями. Функция G98 отменяется при помощи G99.",
    "example": ""
  },
  {
    "id": "99",
    "title": "G99",
    "name": " Возврат к плоскости отвода в цикле",
    "description": "Если постоянный цикл станка работает совместно с функцией G99, то инструмент возвращается к плоскости отвода между всеми обрабатываемыми отверстиями. Функция G99 отменяется при помощи G98.",
    "example": null
  }
]