[
  {
    "id": "0",
    "title": "M00",
    "name": "Запрограммированный останов ",
    "description": "Запрограммированный останов. Когда СЧПУ исполняет команду М00, то происходит так называемый запрограммированный останов. Все осевые перемещения останавливаются и возобновляются лишь после того, как оператор станка нажмет клавишу Старт цикла на панели УЧПУ. При этом шпиндель продолжает вращаться (у большинства станков) и другие функции остаются активными. Если оператор станка нажимает клавишу Старт цикла, то выполнение программы будет продолжено с кадра, следующего за М00.",
    "example": "G0 X0 Y0 Z100 M0;"
  },
  {
    "id": "1",
    "title": "M01",
    "name": "Запрограммированный останов по выбору",
    "description": "Останов по выбору. Код М01 предназначен для останова по выбору. Действует он аналогично коду М00, однако предоставляет выбор оператору – нужно или не нужно прерывать выполнение управляющей программы. На панели УЧПУ практически любого станка имеется клавиша (или переключатель) М01. Если эта клавиша нажата, то при чтении кадра с М01 происходит останов. Если же клавиша не нажата, то кадр М01 пропускается и выполнение УП не прерывается.",
    "example": "G0 X0 Y0 Z100 M1;"
  },
  {
    "id": "2",
    "title": "M02",
    "name": "Конец программы",
    "description": "Конец программы. Код М02 информирует СЧПУ о завершении программы.",
    "example": "M02;"
  },
  {
    "id": "3",
    "title": "M03",
    "name": "Прямое вращение шпинделя",
    "description": "Прямое вращение шпинделя. При помощи кода М03 включается прямое (по часовой стрелке) вращение шпинделя с запрограммированным числом оборотов (S-слово). Команда М03 остается действующей до тех пор, пока она не будет отменена с помощью М04 или М05.",
    "example": "M3 S2000;"
  },
  {
    "id": "4",
    "title": "М04",
    "name": "Обратное вращение шпинделя",
    "description": "Обратное вращение шпинделя. При помощи кода М04 включается обратное (против часовой стрелки) вращение шпинделя с запрограммированным числом оборотов (S-слово). Команда М04 остается действующей до тех пор, пока она не будет отменена с помощью М03 или М05.",
    "example": "M4 S2000;"
  },
  {
    "id": "5",
    "title": "M05",
    "name": "Останов шпинделя",
    "description": "Останов шпинделя. Команда М05 останавливает вращение шпинделя, но не останавливает осевые перемещения (за исключением режима G95).",
    "example": "M5;"
  },
  {
    "id": "6",
    "title": "М06",
    "name": "Автоматическая смена инструмента",
    "description": "Автоматическая смена инструмента. При помощи команды М06 инструмент, закрепленный в шпинделе, меняется на инструмент, находящийся в положении готовности в магазине инструментов.",
    "example": "M6 T10;"
  },
  {
    "id": "7",
    "title": "M07",
    "name": "Включить дополнительное охлаждение",
    "description": "Включение подачи СОЖ в распыленном виде. Команда М07 включает подачу СОЖ в зону обработки в распыленном виде, если станок обладает такой возможностью.",
    "example": "M3 S2000 M7;"
  },
  {
    "id": "8",
    "title": "M08",
    "name": "Включить подачу СОЖ",
    "description": "Включение подачи СОЖ. Команда М08 включает подачу СОЖ в зону обработки в виде струи.",
    "example": "M3 S2000 M8;"
  },
  {
    "id": "9",
    "title": "M09",
    "name": "Выключение подачи СОЖ",
    "description": "Выключение подачи СОЖ. Команда М09 выключает подачу СОЖ и отменяет команды М07 и М08.",
    "example": "G0 X0 Y0 Z100 M5 M9;"
  },
  {
    "id": "19",
    "title": "М19",
    "name": "Юстировка (блокировка) шпинделя",
    "description": "Юстировка шпинделя. При помощи команды M19 осуществляется радиальная юстировка шпинделя (поворот в определенное положение), чтобы выставить приводной носик шпинделя на позицию смены инструмента. В этом положении шпиндель обычно зажимается и его не провернуть рукой.",
    "example": "М19;"
  },
  {
    "id": "20",
    "title": "М20 ",
    "name": "Отмена юстировки (блокировки) шпинделя",
    "description": "Отмена юстировки (блокировки) шпинделя. При помощи команды М20 отменяется команда юстировки шпинделя М19.",
    "example": "М20;"
  },
  {
    "id": "30",
    "title": "M30",
    "name": "Конец программы",
    "description": "Конец программы, перевод курсора к началу программы.  Код М30 информирует СЧПУ о завершении программы.",
    "example": "M30;"
  },
  {
    "id": "98",
    "title": "M98",
    "name": "Вызов подпрограммы",
    "description": "Вызов подпрограммы. Команда М98 предназначена для вызова подпрограммы. Вместе с этой командой программируется Р-слово данных, которое обозначает номер вызываемой подпрограммы. Р101 – вызвать подпрограмму О101",
    "example": "M98 P101;"
  },
  {
    "id": "99",
    "title": "M99",
    "name": "Конец подпрограммы",
    "description": "Конец подпрограммы, возврат к основной программе. При помощи команды М99 по окончании подпрограммы осуществляется возврат к главной программе, из которой была вызвана подпрограмма.",
    "example": "M99;"
  }
]
