var SIEMENS_SINUMERIK_MILL = [
  {
    "code": "G00",
    "name": "Быстрый ход"
  },
  {
    "code": "G01",
    "name": "Линейное движение"
  },
  {
    "code": "G02",
    "name": "Круговая интерполяция по часовой стрелке"
  },
  {
    "code": "G03",
    "name": "Круговая интерполяция против часовой стрелки"
  },
  {
    "code": "G04",
    "name": "Время задержки в [s] или оборотах шпинделя"
  },
  {
    "code": "G05",
    "name": "Цикл высокоскоростного резания"
  },
  {
    "code": "G05.1",
    "name": "Цикл высокоскоростного резания -> Вызов CYCLE305"
  },
  {
    "code": "G08",
    "name": "Предварительное управление ON / OFF (G15) Полярные координаты выключены"
  },
  {
    "code": "G09",
    "name": "Точная остановка"
  },
  {
    "code": "G10",
    "name": "Записать смещение инструмента / смещение инструмента"
  },
  {
    "code": "G10.6",
    "name": "Отвод от контура (POLF)"
  },
  {
    "code": "G11",
    "name": "Ввод конечного параметра"
  },
  {
    "code": "G16",
    "name": "Полярные координаты"
  },
  {
    "code": "G17",
    "name": "Плоскость XY"
  },
  {
    "code": "G18",
    "name": "Плоскость ZX"
  },
  {
    "code": "G19",
    "name": "Плоскость YZ"
  },
  {
    "code": "G20",
    "name": "Система ввода -  дюймы"
  },
  {
    "code": "G21",
    "name": "Метрическая система ввода"
  },
  {
    "code": "G27",
    "name": "Проверка контрольной позиции"
  },
  {
    "code": "G28",
    "name": "Вернуться на референтную точку"
  },
  {
    "code": "G30",
    "name": "Вернуться на референтную точку (2, 3, 4)"
  },
  {
    "code": "G30.1",
    "name": "Позиция референтной точки"
  },
  {
    "code": "G31",
    "name": "Измерение с «удалением расстояния до цели»"
  },
  {
    "code": "G40",
    "name": "Отмена коррекции на радиус инструмента"
  },
  {
    "code": "G41",
    "name": "Левая коррекция на радиус инструмента"
  },
  {
    "code": "G42",
    "name": "Правая коррекция на радиус инструмента"
  },
  {
    "code": "G43",
    "name": "Коррекция на длину инструмента инструмента"
  },
  {
    "code": "G44",
    "name": "Отрицательная коррекция на длину инструмента"
  },
  {
    "code": "G49",
    "name": "Отключить коррекцию на длину инструмента"
  },
  {
    "code": "G50",
    "name": "Масштабирование (Выкл.)"
  },
  {
    "code": "G51",
    "name": "Масштабирование (Вкл.)"
  },
  {
    "code": "G50.1",
    "name": "Зеркальное отражение по запрограммированной оси (Выкл.)"
  },
  {
    "code": "G51.1",
    "name": "Зеркальное отражение по запрограммированной оси (Вкл..)"
  },
  {
    "code": "G52",
    "name": "Локальная система координат"
  },
  {
    "code": "G53",
    "name": "Отмена смещения нулевой точки на координатной системе станка. Действует в покадровом режиме."
  },
  {
    "code": "G54",
    "name": "Переключиться на заданную систему координат"
  },
  {
    "code": "G55",
    "name": "Переключиться на заданную систему координат"
  },
  {
    "code": "G56",
    "name": "Переключиться на заданную систему координат"
  },
  {
    "code": "G57",
    "name": "Переключиться на заданную систему координат"
  },
  {
    "code": "G58",
    "name": "Переключиться на заданную систему координат"
  },
  {
    "code": "G59",
    "name": "Переключиться на заданную систему координат"
  },
  {
    "code": "G60",
    "name": "Режим точного останова"
  },
  {
    "code": "G61",
    "name": "Точный стоп"
  },
  {
    "code": "G63",
    "name": "Режим нарезания резьбы"
  },
  {
    "code": "G64",
    "name": "Непрерывный режим"
  },
  {
    "code": "G65",
    "name": "Вызов макроса"
  },
  {
    "code": "G66",
    "name": "Вызов модуля макросов"
  },
  {
    "code": "G67",
    "name": "Удалить модуль макросов"
  },
  {
    "code": "G68",
    "name": "Вращение включено, 2D / 3D"
  },
  {
    "code": "G69",
    "name": "Вращение выключено"
  },
  {
    "code": "G72.1",
    "name": "Повторение контуров с вращением"
  },
  {
    "code": "G72.2",
    "name": "Линейное контурное повторение"
  },
  {
    "code": "G73",
    "name": "Высокоскоростной цикл сверления глубоких отверстий  с выводом стружки"
  },
  {
    "code": "G74",
    "name": "Цикл нарезки левой резьбы"
  },
  {
    "code": "G76",
    "name": "Цикл сверления"
  },
  {
    "code": "G80",
    "name": "Выключить цикл"
  },
  {
    "code": "G81",
    "name": "Цикл сверления"
  },
  {
    "code": "G82",
    "name": "Цикл сверления по контуру"
  },
  {
    "code": "G83",
    "name": "Цикл сверления глубоких отверстий с удалением стружки"
  },
  {
    "code": "G84",
    "name": "Прямой цикл нарезания резьбы"
  },
  {
    "code": "G85",
    "name": "Цикл сверления, вывод инструмента та рабочей подаче (G01) без остановки шпинделя"
  },
  {
    "code": "G86",
    "name": "Цикл сверления, вывод инструмента ускоренной подаче (G00) после  остановки шпинделя"
  },
  {
    "code": "G87",
    "name": "Обратное зенкование"
  },
  {
    "code": "G89",
    "name": "Цикл сверления, остановка на некоторое время, а затем отвод с помощью G01, без изменения направления вращения шпинделя"
  },
  {
    "code": "G90",
    "name": "Абсолютная система координат"
  },
  {
    "code": "G91",
    "name": "Относительная система координат"
  },
  {
    "code": "G92",
    "name": "Установка фактического значения"
  },
  {
    "code": "G92.1",
    "name": "Удалить фактическое значение, сбросить WKS"
  },
  {
    "code": "G93",
    "name": "Скорость подачи в обратном направлении (1 / мин)"
  },
  {
    "code": "G94",
    "name": "Подача в [мм/мин, дюйм/мин]"
  },
  {
    "code": "G95",
    "name": "Подача в [мм/оборот, дюйм/оборот]"
  },
  {
    "code": "G96",
    "name": "Постоянная скорость резания"
  },
  {
    "code": "G97",
    "name": "Постоянное число оборотов"
  },
  {
    "code": "G98",
    "name": "Возврат к исходной плоскости в цикле"
  },
  {
    "code": "G99",
    "name": "Возврат к плоскости отвода в цикле"
  },
  {
    "code": "G290",
    "name": "Выбор режима Siemens"
  },
  {
    "code": "G291",
    "name": "Выбор режима диалектов ISO"
  }
];