// Ошибки Lynx M/MS
var LYNX_200M = [
  {
    "code": "Номер ошибки",
    "description": "Название"
  },
  {
    "code": "2001",
    "description": "Нажата аварийная кнопка или произошел аварийный останов осей"
  },
  {
    "code": "2002",
    "description": "Обнаружена ошибка шпинделя"
  },
  {
    "code": "2003",
    "description": "Обнаружено короткое замыкание (сверхток) в цепи питания"
  },
  {
    "code": "2004",
    "description": "Перегрузка гидравлической помпы насоса"
  },
  {
    "code": "2005",
    "description": "Низкое давление гидравлики"
  },
  {
    "code": "2006",
    "description": "Ошибка проверки переключения скорости шпинделя"
  },
  {
    "code": "2008",
    "description": "Ошибка проверки сигнала"
  },
  {
    "code": "2009",
    "description": "Ошибка настроек удерживающих реле выбора модели станка"
  },
  {
    "code": "2010",
    "description": "Ошибка настроек удерживающих реле (смена обмоток)"
  },
  {
    "code": "2030",
    "description": "Задание блокировки станка в недопустимом режиме"
  },
  {
    "code": "2031",
    "description": "Выполните выход в нуль станка в ручном режиме"
  },
  {
    "code": "2032",
    "description": "Нажата кнопка «Стоп подачи»"
  },
  {
    "code": "2033",
    "description": "Низкое давление воздуха"
  },
  {
    "code": "2034",
    "description": "Перегрузка двигателя СОЖ/АТС/смазки"
  },
  {
    "code": "2036",
    "description": "Низкий уровень СОЖ"
  },
  {
    "code": "2040",
    "description": "Открыта дверь оператора"
  },
  {
    "code": "2041",
    "description": "Превышение времени ожидания задания автоматической двери"
  },
  {
    "code": "2042",
    "description": "Ошибка задания перезапуска программы"
  },
  {
    "code": "2043",
    "description": "Ошибка задания программного старта М-кода"
  },
  {
    "code": "2044",
    "description": "Режим"
  },
  {
    "code": "2046",
    "description": "Сломан инструмент (система Мониторинга Инструмента)"
  },
  {
    "code": "2048",
    "description": "Ошибка останова шпинделя"
  },
  {
    "code": "2049",
    "description": "Ошибка сигнала достигнутых оборотов шпинделя"
  },
  {
    "code": "2050",
    "description": "Ошибка задания вращения шпинделя"
  },
  {
    "code": "2051",
    "description": "Превышение времени ожидания ориентации шпинделя"
  },
  {
    "code": "2053",
    "description": "Превышение времени ожидания смены обмоток шпинделя"
  },
  {
    "code": "2056",
    "description": "Превышение времени ожидания скорости шпинделя"
  },
  {
    "code": "2090",
    "description": "Ошибка датчика подтверждения зажима/разжима патрона"
  },
  {
    "code": "2091",
    "description": "Превышение времени ожидания задания патрона"
  },
  {
    "code": "2092",
    "description": "Превышение времени ожидания задания задней бабки"
  },
  {
    "code": "2093",
    "description": "Превышение времени ожидания задания подключения основания задней"
  },
  {
    "code": "2094",
    "description": "Превышение времени ожидания задания выгрузки деталей"
  },
  {
    "code": "2098",
    "description": "Превышение времени ожидания задания пруткоподатчика"
  },
  {
    "code": "2100",
    "description": "Превышение времени ожидания задания люнета"
  },
  {
    "code": "2101",
    "description": "Превышение времени ожидания задания"
  },
  {
    "code": "2102",
    "description": "Ошибка зажима шпинделя"
  },
  {
    "code": "2105",
    "description": "Перегрузка приводного шпинделя (инструмента)"
  },
  {
    "code": "2106",
    "description": "Превышение времени ожидания смены оси С"
  },
  {
    "code": "2107",
    "description": "Превышение времени ожидания задания зажима/разжима оси С"
  },
  {
    "code": "2108",
    "description": "Не отключен тормоз оси С"
  },
  {
    "code": "2112",
    "description": "Ошибка операции выдвижения заготовки"
  },
  {
    "code": "2113",
    "description": "Ошибка включения приводного инструмента"
  },
  {
    "code": "2114",
    "description": "Недопустимое положение в контроле синхронизации"
  },
  {
    "code": "2115",
    "description": "Недопустимое положение в режиме контроля двух шпинделей"
  },
  {
    "code": "2116",
    "description": "Ошибка индексного положения инструмента и приводного шпинделя"
  },
  {
    "code": "2117",
    "description": "Ошибка настроек удерживающих реле выбора револьверной головы"
  },
  {
    "code": "2118",
    "description": "Ошибка датчика зажима/разжима револьверной головы"
  },
  {
    "code": "2119",
    "description": "Превышение времени ожидания индексирования револьверной головы"
  },
  {
    "code": "2120",
    "description": "Ошибка задания смены револьверной головы"
  },
  {
    "code": "2124",
    "description": "Ошибка сервопривода револьверной головы"
  },
  {
    "code": "2126",
    "description": "Ошибка задания"
  },
  {
    "code": "2127",
    "description": "Ошибка задания пропуска по крутящему моменту"
  },
  {
    "code": "2128",
    "description": "Ошибка задания двойного зажима"
  },
  {
    "code": "2129",
    "description": "Ошибка задания оси"
  },
  {
    "code": "2131",
    "description": "Ошибка задания жесткого нарезания резьбы"
  },
  {
    "code": "2134",
    "description": "Ошибка работы внешнего загрузчика деталей"
  },
  {
    "code": "2144",
    "description": "Ошибка низкого напряжения: проверьте входное напряжение 220В "
  },
  {
    "code": "2145",
    "description": "Ошибка высокого напряжения: проверьте входное напряжение 220В"
  },
  {
    "code": "2146",
    "description": "Ошибка перегрева: привод револьверной головы включился и включился"
  },
  {
    "code": "2147",
    "description": "Ошибка кабеля: проверьте информационный кабель датчика револьверной головы"
  },
  {
    "code": "2148",
    "description": "Ошибка превышения скорости: проверьте информационный кабель датчика револьверной головы"
  },
  {
    "code": "2149",
    "description": "Ошибка перегрузки: проверьте статусы перегрузки револьверной головы"
  },
  {
    "code": "2150",
    "description": "Ошибка настроек: проверьте параметры привода револьверной головы"
  },
  {
    "code": "2151",
    "description": "Ошибка параметров: сбросьте параметры привода револьверной головы"
  },
  {
    "code": "2152",
    "description": "Ошибка остатка импульса: проверьте информационный кабель датчика револьверной головы"
  },
  {
    "code": "2153",
    "description": "Ошибка тока: проверьте параметры №№29,39 привода револьверной"
  },
  {
    "code": "2154",
    "description": "Ошибка батареи: замените батарею датчика в приводе револьверной головы"
  },
  {
    "code": "2156",
    "description": "Ошибка команды загрузки в станок"
  },
  {
    "code": "2158",
    "description": "Ошибка превышения времени ожидания смены шпинделя"
  },
  {
    "code": "2160",
    "description": "Низкий уровень масла в системе смазки направляющих"
  },
  {
    "code": "2161",
    "description": "Низкое давление масла в системе смазки направляющих"
  },
  {
    "code": "2162",
    "description": "Сигнал конца отсчета деталей"
  },
  {
    "code": "2168",
    "description": "Ошибка низкого давления СОЖ"
  },
  {
    "code": "2169",
    "description": "Ошибка низкого давления подачи СОЖ с высоким давлением"
  },
  {
    "code": "2170",
    "description": "Сигнал конца жизни инструмента"
  },
  {
    "code": "2179",
    "description": "Ошибка проверки уровня масла в редукторе шпинделя"
  },
  {
    "code": "2189",
    "description": "Ошибка датчиков проверки зажима"
  },
  {
    "code": "2191",
    "description": "Ошибка задания контроля крутящего момента"
  },
  {
    "code": "2192",
    "description": "Сигнал предупреждения износа инструмента"
  },
  {
    "code": "2193",
    "description": "Разблокирован датчик безопасности на двери оператора"
  },
  {
    "code": "2197",
    "description": "Ошибка транспортера стружки"
  },
  {
    "code": "2198",
    "description": "Готовность автоматического выключения станка"
  },
  {
    "code": "2202",
    "description": "Статус: блокировка станка включена"
  },
  {
    "code": "2204",
    "description": "Потенциометр (переключатель) рабочей подачи установлен на 0%"
  },
  {
    "code": "2208",
    "description": "Станок в сервисном режиме"
  },
  {
    "code": "2222",
    "description": "Низкий уровень масла в системе смазки направляющих"
  },
  {
    "code": "2223",
    "description": "Ошибка задания движения осей"
  },
  {
    "code": "2224",
    "description": "Задан возврат в нулевые позиции станка в нулевых положениях"
  },
  {
    "code": "2231",
    "description": "Ошибка переключения шпинделя в режиме жесткого нарезания резьбы"
  },
  {
    "code": "2356",
    "description": "Ошибка блока сигнализации"
  },
  {
    "code": "2360",
    "description": "Статус: патрон разжат"
  },
  {
    "code": "2361",
    "description": "Ошибка проверки датчика зажима/разжима основания задней бабки к суппорту"
  },
  {
    "code": "2362",
    "description": "Ошибка проверки датчика перемещения руки"
  },
  {
    "code": "2363",
    "description": "Низкий заряд батареи привода револьверной головы"
  },
  {
    "code": "2364",
    "description": "Смена корректора инструмента в режиме маховичка"
  },
  {
    "code": "2366",
    "description": "Ошибка переключения двойного зажима"
  },
  {
    "code": "2367",
    "description": "Ошибка задания жесткого нарезания резьбы и ориентации шпинделя в режиме"
  },
  {
    "code": "2379",
    "description": "Загрузчик в станке в ручном режиме"
  },
  {
    "code": "2385",
    "description": "Вращение шпинделя в сервисном режиме станка"
  },
  {
    "code": "2386",
    "description": "Статус: переключатель перезапуска программы активирован"
  },
  {
    "code": "2389",
    "description": "Ошибка считывания"
  }
]