// Ошибки Puma MX
var PUMA_MX = [
  {
    "code": "2001",
    "description": "Нажата аварийная кнопка или произошел аварийный останов осей"
  },
  {
    "code": "2002",
    "description": "Обнаружена ошибка главного шпинделя"
  },
  {
    "code": "2003",
    "description": "Обнаружено короткое замыкание (сверхток) в цепи питания или поломка предохранителя"
  },
  {
    "code": "2005",
    "description": "Ошибка гидравлической системы"
  },
  {
    "code": "2008",
    "description": "Ошибка проверки сигнала PSM"
  },
  {
    "code": "2009",
    "description": "Ошибка настроек удерживающих реле выбора модели станка"
  },
  {
    "code": "2029",
    "description": "Разжат инструмент фрезерного шпинделя"
  },
  {
    "code": "2030",
    "description": "Задание блокировки станка в недопустимом режиме"
  },
  {
    "code": "2031",
    "description": "Необходим возврат в нулевые точки станка в ручном режиме"
  },
  {
    "code": "2032",
    "description": "Нажата кнопка «Стоп подачи»"
  },
  {
    "code": "2033",
    "description": "Низкое давление воздуха"
  },
  {
    "code": "2034",
    "description": "Перегрузка двигателя СОЖ/АТС/смазки"
  },
  {
    "code": "2035",
    "description": "Ошибка дополнительного двигателя СОЖ"
  },
  {
    "code": "2040",
    "description": "Открыта дверь оператора"
  },
  {
    "code": "2041",
    "description": "Превышение времени ожидания задания автоматической двери"
  },
  {
    "code": "2042",
    "description": "Ошибка задания перезапуска программы"
  },
  {
    "code": "2043",
    "description": "Ошибка задания программного старта М-кода"
  },
  {
    "code": "2044",
    "description": "Режим Dry Run (ускоренная отработка программы)"
  },
  {
    "code": "2046",
    "description": "Сломан инструмент (система Мониторинга Инструмента)"
  },
  {
    "code": "204",
    "description": "Сломан инструмент (система обмера инструмента)"
  },
  {
    "code": "2049",
    "description": "Ошибка сигнала достигнутых оборотов шпинделя"
  },
  {
    "code": "2051",
    "description": "Превышение времени ожидания ориентации шпинделя"
  },
  {
    "code": "2052",
    "description": "Ошибка настроек максимальных оборотов шпинделя или угловой головы"
  },
  {
    "code": "2054",
    "description": "Недопустимое положение при вращении шпинделя"
  },
  {
    "code": "2056",
    "description": "Превышение времени ожидания скорости шпинделя"
  },
  {
    "code": "2057",
    "description": "Ошибка датчика задания зажима инструмента шпинделя"
  },
  {
    "code": "2058",
    "description": "(АТС): Ошибка настройки удерживающих реле выбора магазина инструмента"
  },
  {
    "code": "2059",
    "description": "(АТС): Ошибка задания недопустимого положения Т-кода"
  },
  {
    "code": "2060",
    "description": "(АТС): Ошибка задания недопустимого М06"
  },
  {
    "code": "2061",
    "description": "(АТС): Ошибка задание Т-кода"
  },
  {
    "code": "2062",
    "description": "(АТС): Превышение времени ожидания задания М06"
  },
  {
    "code": "2069",
    "description": "Блокировка оси Х"
  },
  {
    "code": "2070",
    "description": "Блокировка оси Y"
  },
  {
    "code": "2071",
    "description": "Блокировка оси Z"
  },
  {
    "code": "2072",
    "description": "Блокировка оси W"
  },
  {
    "code": "2076",
    "description": "Блокировка оси Х2"
  },
  {
    "code": "2077",
    "description": "Блокировка оси Z2"
  },
  {
    "code": "2081",
    "description": "Ошибка Air-Bag PMC"
  },
  {
    "code": "2087",
    "description": "Недопустимое положение в контроле синхронизации оси С"
  },
  {
    "code": "2088",
    "description": "Ошибка задания номера Р шпинделя"
  },
  {
    "code": "2089",
    "description": "Открыта дверь АТС"
  },
  {
    "code": "2090",
    "description": "Ошибка датчика подтверждения зажима/разжима патрона"
  },
  {
    "code": "2092",
    "description": "Ошибка задания задней бабки. Отмените режим нагрузки ( G 301) или проверьте датчик нагрузки X 73"
  },
  {
    "code": "2094",
    "description": "Превышение времени ожидания задания выгрузки деталей"
  },
  {
    "code": "2096",
    "description": "Ошибка задания операции выгрузки деталей"
  },
  {
    "code": "2097",
    "description": "Ошибка проверки датчика выгрузки деталей"
  },
  {
    "code": "2098",
    "description": "Ошибка превышения ожидания команды подачи прутка"
  },
  {
    "code": "2099",
    "description": "Ошибка подачи прутка"
  },
  {
    "code": "2100",
    "description": "Превышение времени ожидания задания люнета"
  },
  {
    "code": "2101",
    "description": "Превышение времени ожидания задания Q - setter"
  },
  {
    "code": "2102",
    "description": "Ошибка зажима шпинделя"
  },
  {
    "code": "2104",
    "description": "Ошибка операции правого шпинделя"
  },
  {
    "code": "2105",
    "description": "Перегрузка фрезерного шпинделя"
  },
  {
    "code": "2107",
    "description": "Превышение времени ожидания задания зажима/разжима оси С"
  },
  {
    "code": "2108",
    "description": "Не отключен тормоз оси С"
  },
  {
    "code": "2109",
    "description": "Ошибка задания зажима/разжима оси С в режиме составного контроля"
  },
  {
    "code": "2110",
    "description": "Ошибка задания ручной операции оси С в режиме составного контроля"
  },
  {
    "code": "2111",
    "description": "Необходим возврат в нулевую точку для оси Z 2"
  },
  {
    "code": "2112",
    "description": "Ошибка операции подачи детали"
  },
  {
    "code": "2114",
    "description": "Недопустимое положение в контроле синхронизации шпинделей"
  },
  {
    "code": "2116",
    "description": "Ошибка проверки переключателя крепления инструмента"
  },
  {
    "code": "2118",
    "description": "Статус: револьверная голова разжата. Проверьте датчик или поверните в ручную"
  },
  {
    "code": "2119",
    "description": "Превышение времени ожидания индексирования револьверной головы"
  },
  {
    "code": "2120",
    "description": "Ошибка задания смены револьверной головы"
  },
  {
    "code": "2121",
    "description": "Ошибка проверки датчика крепления инструмента"
  },
  {
    "code": "2122",
    "description": "Статус: разжат револьверной головы в режиме рабочей подачи"
  },
  {
    "code": "2123",
    "description": "Запрещенная зона индексирования револьверной головы"
  },
  {
    "code": "2124",
    "description": "Ошибка сервопривода револьверной головы"
  },
  {
    "code": "2125",
    "description": "Ошибка задания мини револьверной головы"
  },
  {
    "code": "2126",
    "description": "Ошибка задания M , T -кода в режиме контроля PMC"
  },
  {
    "code": "2127",
    "description": "Ошибка задания пропуска по крутящему моменту"
  },
  {
    "code": "2128",
    "description": "Ошибка задания двойного зажима"
  },
  {
    "code": "2129",
    "description": "Требуется ручной возврат в нулевые точки"
  },
  {
    "code": "2130",
    "description": "Ошибка задания выбора оси С"
  },
  {
    "code": "2131",
    "description": "Ошибка задания жесткого нарезания резьбы"
  },
  {
    "code": "2132",
    "description": "Запрещенное перемещение осей в положении зажатого патрона"
  },
  {
    "code": "2133",
    "description": "Блокировка перемещения осей"
  },
  {
    "code": "2136",
    "description": "Ошибка переключения оси В"
  },
  {
    "code": "2137",
    "description": "Превышение времени ожидания ориентации фрезерного шпинделя"
  },
  {
    "code": "2138",
    "description": "Статус: фрезерный шпиндель разжат"
  },
  {
    "code": "2139",
    "description": "Ошибка угла оси В"
  },
  {
    "code": "2141",
    "description": "Ось С не в нулевой точке (синхронизация)"
  },
  {
    "code": "2142",
    "description": "Ошибка датчика воздуха зажима инструмента во фрезерном шпинделе или нет инструмента во фрезерном шпинделе"
  },
  {
    "code": "2143",
    "description": "Ошибка смены обмоток шпинделя"
  },
  {
    "code": "2144",
    "description": "Ошибка низкого напряжения: проверьте входное напряжение 220В "
  },
  {
    "code": "2145",
    "description": "Ошибка высокого напряжения: проверьте входное напряжение 220В"
  },
  {
    "code": "2146",
    "description": "Ошибка перегрева: привод револьверной головы включился и включился"
  },
  {
    "code": "2147",
    "description": "Ошибка кабеля: проверьте информационный кабель датчика револьверной головы"
  },
  {
    "code": "2148",
    "description": "Ошибка превышения скорости: проверьте информационный кабель датчика револьверной головы"
  },
  {
    "code": "2149",
    "description": "Ошибка перегрузки: проверьте статусы перегрузки револьверной головы"
  },
  {
    "code": "2150",
    "description": "Ошибка настроек: проверьте параметры привода револьверной головы"
  },
  {
    "code": "2151",
    "description": "Ошибка параметров: сбросьте параметры привода револьверной головы"
  },
  {
    "code": "2152",
    "description": "Ошибка остатка импульса: проверьте информационный кабель датчика револьверной головы"
  },
  {
    "code": "2153",
    "description": "Ошибка тока: проверьте параметры №№29,39 привода револьверной"
  },
  {
    "code": "2154",
    "description": "Ошибка батареи: замените батарею датчика в приводе револьверной головы"
  },
  {
    "code": "2155",
    "description": "Ошибка положения вращения револьверной головы (13-24 инструмент)"
  },
  {
    "code": "2160",
    "description": "Низкий уровень масла в системе смазки направляющих"
  },
  {
    "code": "2161",
    "description": "Низкое давление масла в системе смазки направляющих"
  },
  {
    "code": "2162",
    "description": "Сигнал конца отсчета деталей"
  },
  {
    "code": "2164",
    "description": "Ошибка системы охлаждения масла"
  },
  {
    "code": "2165",
    "description": "Ошибка потока системы охлаждения масла"
  },
  {
    "code": "2166",
    "description": "Ошибка замены фильтра СОЖ"
  },
  {
    "code": "2168",
    "description": "Ошибка низкого давления СОЖ"
  },
  {
    "code": "2170",
    "description": "Сигнал конца жизни инструмента"
  },
  {
    "code": "2173",
    "description": "Определение ожидающей ячейки или ячейки инструмента в магазине"
  },
  {
    "code": "2180",
    "description": "Ошибка замены фильтра подачи СОЖ под давлением"
  },
  {
    "code": "2181",
    "description": "Масляный туман не подается"
  },
  {
    "code": "2182",
    "description": "Низкий уровень масла в баке масляного тумана"
  },
  {
    "code": "2189",
    "description": "Ошибка датчика проверки зажима патрона"
  },
  {
    "code": "2191",
    "description": "Ошибка задания контроля крутящего момента"
  },
  {
    "code": "2192",
    "description": "Сигнал предупреждения износа инструмента"
  },
  {
    "code": "2193",
    "description": "Разблокирован датчик безопасности на двери оператора"
  },
  {
    "code": "2194",
    "description": "Ошибка возвратного движения задней бабки"
  },
  {
    "code": "2195",
    "description": "Необходимо открыть дверь"
  },
  {
    "code": "2197",
    "description": "Ошибка транспортера стружки"
  },
  {
    "code": "2198",
    "description": "Готовность автоматического выключения станка"
  },
  {
    "code": "2200",
    "description": "Требуется разогрев шпинделя. Пожалуйста, задайте М102 и дождитесь завершения"
  },
  {
    "code": "2201",
    "description": "Запущена предварительная смазка шпинделя (подождите 10 или более минут)"
  },
  {
    "code": "2202",
    "description": "Статус: блокировка станка включена"
  },
  {
    "code": "2204",
    "description": "Потенциометр (переключатель) рабочей подачи установлен на 0%"
  },
  {
    "code": "2205",
    "description": "Низкий заряд батареи датчика обмера детали (заготовки)"
  },
  {
    "code": "2207",
    "description": "Оси Y и Z в зоне столкновения"
  },
  {
    "code": "2208",
    "description": "Станок в сервисном режиме"
  },
  {
    "code": "2209",
    "description": "Рассогласование в номере программы"
  },
  {
    "code": "2217",
    "description": "Необходим возврат в нулевую точку для оси Y"
  },
  {
    "code": "2231",
    "description": "Ошибка переключения шпинделя в режиме жесткого нарезания резьбы"
  },
  {
    "code": "2241",
    "description": "(АТС): Данные ожидающего инструмента и инструмента в шпинделе равны нулю"
  },
  {
    "code": "2242",
    "description": "Необходимо задание следующего номера инструмента"
  },
  {
    "code": "2245",
    "description": "Ошибка проверки открывания/закрывания двери АТС"
  },
  {
    "code": "2248",
    "description": "(АТС): Ошибка задания операции АТС"
  },
  {
    "code": "2250",
    "description": "(АТС): Выбран ручной режим на панель АТС"
  },
  {
    "code": "2251",
    "description": "(АТС): Превышение времени ожидания смены АТС"
  },
  {
    "code": "2252",
    "description": "Блокировка автоматической смены инструмента"
  },
  {
    "code": "2254",
    "description": "(АТС): Превышение времени ожидания каретки АТС"
  },
  {
    "code": "2255",
    "description": "(АТС): Ошибка вытягивания/втягивания руки АТС"
  },
  {
    "code": "2260",
    "description": "(АТС): Превышение времени ожидания вращения магазина АТС"
  },
  {
    "code": "2261",
    "description": "(АТС): Разблокирована дверь магазина АТС"
  },
  {
    "code": "2262",
    "description": "(АТС): Открыта дверь магазина АТС"
  },
  {
    "code": "2270",
    "description": "Блокировка оси Y"
  },
  {
    "code": "2273",
    "description": "Ошибка штока: Ошибка позиции штока. Переместите ожидающую ячейку в ручную в нулевую точку"
  },
  {
    "code": "2274",
    "description": "(АТС): Ошибка датчика ожидающей ячейки"
  },
  {
    "code": "2275",
    "description": "Устройство загрузки инструмента в магазин не в исходном положении"
  },
  {
    "code": "2343",
    "description": "Ошибка сверхвысокой температуры датчика PT 1"
  },
  {
    "code": "2344",
    "description": "Ошибка сверхвысокой температуры датчика PT 2"
  },
  {
    "code": "2348",
    "description": "СН1 – Температурные данные вне пределов"
  },
  {
    "code": "2349",
    "description": "СН1 – Отсоединение разъема или кабеля"
  },
  {
    "code": "2350",
    "description": "СН3 – Температурные данные вне пределов"
  },
  {
    "code": "2351",
    "description": "Отклонение от нормы внутреннего тока"
  },
  {
    "code": "2352",
    "description": "Неверный модуль"
  },
  {
    "code": "2353",
    "description": "СН2 – Температурные данные вне пределов"
  },
  {
    "code": "2354",
    "description": "СН2 – Отсоединение разъема или кабеля"
  },
  {
    "code": "2357",
    "description": "Ошибка ориентации фрезерного шпинделя"
  },
  {
    "code": "2358",
    "description": "Фрезерный шпиндель разжат в токарном режиме"
  },
  {
    "code": "2360",
    "description": "Статус: патрон разжат"
  },
  {
    "code": "2362",
    "description": "Ошибка проверки датчика перемещения руки Q - setter вверх/вниз"
  },
  {
    "code": "2363",
    "description": "Низкий заряд батареи привода револьверной головы"
  },
  {
    "code": "2364",
    "description": "Смена корректора инструмента в режиме маховичка"
  },
  {
    "code": "2365",
    "description": "Ошибка датчика переключения контроллеров (фрезерный шпиндель-револьверная голова)"
  },
  {
    "code": "2366",
    "description": "Ошибка переключения двойного зажима"
  },
  {
    "code": "2367",
    "description": "Ошибка задания жесткого нарезания резьбы и ориентации шпинделя в режиме G 96"
  },
  {
    "code": "2380",
    "description": "Для возврата осей Х, Y , Z в нулевые позиции, отмените команду 3 D компенсации"
  },
  {
    "code": "2381",
    "description": "Статус: установлен сервисный режим нулевых точек (К17.7=1 или К0 .6=1)"
  },
  {
    "code": "2382",
    "description": "(АТС): Ожидающая ячейка не в нулевой позиции"
  },
  {
    "code": "2383",
    "description": "Ручной режим АТС или магазина"
  },
  {
    "code": "2384",
    "description": "Ошибка старта цикла т.к. ключ разрешения работы с открытой дверью на позиции «разрешен»"
  },
  {
    "code": "2385",
    "description": "Вращение шпинделя в сервисном режиме станка"
  },
  {
    "code": "2386",
    "description": "Статус: переключатель перезапуска программы активирован"
  },
  {
    "code": "2387",
    "description": "Ошибка зажима фрезерного шпинделя"
  },
  {
    "code": "2388",
    "description": "Открыта дверь АТС"
  },
  {
    "code": "2389",
    "description": "Ошибка считывания Q-setter"
  },
  {
    "code": "2390",
    "description": "Ошибка позиции опускания руки Q - Setter : проверьте возврат в первые (или вторые) нулевые позиции, останов шпинделя и безопасную зону «нижних» осей"
  }
]