var FANUC_MILLING_M = [
  {
    "code": "M00",
    "name": "Останов программы"
  },
  {
    "code": "M01",
    "name": "Останов программы по требованию"
  },
  {
    "code": "М02",
    "name": "Конец программы"
  },
  {
    "code": "М03",
    "name": "Направление вращение шпинделя по ЧС"
  },
  {
    "code": "М04",
    "name": "Направление вращение шпинделя против ЧС"
  },
  {
    "code": "M05",
    "name": "Останов шпинделя"
  },
  {
    "code": "M06",
    "name": "Смена инструмента ATC"
  },
  {
    "code": "М07",
    "name": "Вкл. подачи СОЖ через шпиндель"
  },
  {
    "code": "М08",
    "name": "Вкл. подачи СОЖ поливом"
  },
  {
    "code": "М09",
    "name": "Выкл. подачи СОЖ"
  },
  {
    "code": "М10",
    "name": "Зажатие 4й оси"
  },
  {
    "code": "М11",
    "name": "Разжатие 4й оси"
  },
  {
    "code": "М12",
    "name": "Вкл. подачи СОЖ разбрызгиванием"
  },
  {
    "code": "М14",
    "name": "Включение пневмоочистки"
  },
  {
    "code": "М15",
    "name": "Выключение пневмоочистки"
  },
  {
    "code": "М19",
    "name": "Ориентация шпинделя (Блокировка шпинделя)"
  },
  {
    "code": "М20",
    "name": "Вызов загрузчика"
  },
  {
    "code": "М23",
    "name": "Программный запуск M-кода"
  },
  {
    "code": "М24",
    "name": "Запуск конвейера для стружки"
  },
  {
    "code": "М25",
    "name": "Останов конвейера для стружки"
  },
  {
    "code": "М29",
    "name": "Вкл. жесткого нарезания резьбы"
  },
  {
    "code": "М30",
    "name": "Конец программы и перезапуск"
  },
  {
    "code": "М38",
    "name": "Зажатие 5й оси"
  },
  {
    "code": "М39",
    "name": "Разжатие 5й оси"
  },
  {
    "code": "М40",
    "name": "Зажатие 6й оси"
  },
  {
    "code": "М41",
    "name": "Разжатие 6й оси"
  },
  {
    "code": "М45",
    "name": "Установка номера инструмента в шпинделе"
  },
  {
    "code": "М48",
    "name": "Выключение перехода"
  },
  {
    "code": "М49",
    "name": "Включение перехода"
  },
  {
    "code": "М52",
    "name": "Авт. открытие двери"
  },
  {
    "code": "М53",
    "name": "Авт. закрытие двери"
  },
  {
    "code": "М54",
    "name": "Счетчик деталей"
  },
  {
    "code": "М55",
    "name": "Перезапуск программы  после M02/M30"
  },
  {
    "code": "М60",
    "name": "Смена паллета APC"
  },
  {
    "code": "М61",
    "name": "Загрузка 1 паллета APC"
  },
  {
    "code": "М62",
    "name": "Загрузка 2 паллета APC"
  },
  {
    "code": "М66",
    "name": "Одновременная смена ATC & APC"
  },
  {
    "code": "М73",
    "name": "Выкл. датчика измерения инструмента/детали"
  },
  {
    "code": "М74",
    "name": "Выкл. датчика измерения детали"
  },
  {
    "code": "М75",
    "name": "Вкл. датчика измерения инструмента"
  },
  {
    "code": "М76",
    "name": "Поднятие датчика измерения инструмента"
  },
  {
    "code": "М77",
    "name": "Опускание датчика измерения инструмента"
  },
  {
    "code": "М80",
    "name": "Выкл. Зеркальное отображение"
  },
  {
    "code": "М81",
    "name": "Зеркальное отображение оси X"
  },
  {
    "code": "М82",
    "name": "Зеркальное отображение оси Y"
  },
  {
    "code": "М83",
    "name": "Зеркальное отображение оси Z"
  },
  {
    "code": "М84",
    "name": "Зеркальное отображение 4й оси"
  },
  {
    "code": "М85",
    "name": "Зеркальное отображение 5й оси"
  },
  {
    "code": "М91",
    "name": "Внешняя команда M91"
  },
  {
    "code": "М92",
    "name": "Внешняя команда M92"
  },
  {
    "code": "М93",
    "name": "Внешняя команда M93"
  },
  {
    "code": "М94",
    "name": "Внешняя команда M94"
  },
  {
    "code": "М95",
    "name": "Внешняя команда M95"
  },
  {
    "code": "М98",
    "name": "Вызов подпрограммы"
  },
  {
    "code": "М99",
    "name": "Конец подпрограммы"
  },
  {
    "code": "M100",
    "name": "Зажатие фрезерного шпинделя"
  },
  {
    "code": "M101",
    "name": "Разжатие фрезерного шпинделя"
  },
  {
    "code": "M102",
    "name": "Запуск разогрева шпинделя"
  },
  {
    "code": "М106",
    "name": "Вкл. инструмент из паллета"
  },
  {
    "code": "М107",
    "name": "Выкл. инструмент из паллета"
  },
  {
    "code": "М108",
    "name": "Вызов крупного инструмента"
  },
  {
    "code": "M114",
    "name": "Вкл. продувку воздухом через шпиндель"
  },
  {
    "code": "M115",
    "name": "Выкл. продувку воздухом через шпиндель"
  },
  {
    "code": "M117",
    "name": "Перезапуск расчета срока службы инструмента"
  },
  {
    "code": "M118",
    "name": "Пропуск инструмента в управлении сроком службы инструмента"
  },
  {
    "code": "М122",
    "name": "Активировать S-команду без переключения передач"
  },
  {
    "code": "М123",
    "name": "Деактивировать S-команду без переключения передач"
  },
  {
    "code": "М126",
    "name": "Вкл. подачу СОЖ поливом на шпиндельную бабку"
  },
  {
    "code": "М130",
    "name": "Вкл. MQL"
  },
  {
    "code": "М132",
    "name": "Вкл. Собирателя масляного тумана"
  },
  {
    "code": "М133",
    "name": "Выкл. Собирателя масляного тумана"
  },
  {
    "code": "М136",
    "name": "Вкл. продувку канала для отвода СОЖ"
  },
  {
    "code": "М137",
    "name": "Выкл. продувку канала для отвода СОЖ"
  },
  {
    "code": "М138",
    "name": "Вкл. подачу СОЖ на станину"
  },
  {
    "code": "М139",
    "name": "Выкл. подачу СОЖ на станину"
  },
  {
    "code": "М140",
    "name": "Вкл. утилизацию СОЖ из поддона устройства авт. смены инструмента"
  },
  {
    "code": "М141",
    "name": "Выкл. утилизацию СОЖ из поддона устройства авт. смены инструмента"
  },
  {
    "code": "М142",
    "name": "Вкл. звуковой сигнализатор"
  },
  {
    "code": "М148",
    "name": "Зажать инструмент в шпинделе"
  },
  {
    "code": "М149",
    "name": "Разжать инструмент в шпинделе"
  },
  {
    "code": "М150",
    "name": "Многопозиционная ориентация шпинделя"
  },
  {
    "code": "М153",
    "name": "Вкл. продувку измерителя инструмента"
  },
  {
    "code": "М154",
    "name": "Выкл. продувку измерителя инструмента"
  },
  {
    "code": "М159",
    "name": "Вкл. стартовый флаг устр. авт. смены детали (наклоняемый поворотный стол)"
  },
  {
    "code": "М160",
    "name": "Выкл. стартовый флаг устр. авт. смены детали (наклоняемый поворотный стол)"
  },
  {
    "code": "М170",
    "name": "Вызов программы обнаружения поломки инструмента"
  },
  {
    "code": "М176",
    "name": "Зажать зажимное приспособление 1"
  },
  {
    "code": "М177",
    "name": "Разжать зажимное приспособление 1"
  },
  {
    "code": "М178",
    "name": "Зажать зажимное приспособление 2"
  },
  {
    "code": "М179",
    "name": "Разжать зажимное приспособление 2"
  },
  {
    "code": "М180",
    "name": "Зажать зажимное приспособление 3"
  },
  {
    "code": "М181",
    "name": "Разжать зажимное приспособление 3"
  },
  {
    "code": "М182",
    "name": "Зажать зажимное приспособление 4"
  },
  {
    "code": "М183",
    "name": "Разжать зажимное приспособление 4"
  },
  {
    "code": "М184",
    "name": "Движение оси активно при остановке шпинделя"
  },
  {
    "code": "М185",
    "name": "Движение оси неактивно при остановке шпинделя"
  },
  {
    "code": "М198",
    "name": "Вызов субпрограммы с карты памяти"
  },
  {
    "code": "М199",
    "name": "Конец субпрограммы с карты памяти"
  },
  {
    "code": "М200",
    "name": "Вкл. Функцию контроля износа инструмента"
  },
  {
    "code": "М201",
    "name": "Выкл. Функцию контроля износа инструмента"
  },
  {
    "code": "М222",
    "name": "Открыть дверцу АТС"
  },
  {
    "code": "М223",
    "name": "Закрыть дверцу АТС"
  },
  {
    "code": "М231",
    "name": "Стартовый флаг смены устр. авт. смены инструмента"
  },
  {
    "code": "М232",
    "name": "Гнездо ожидания вверх/магазин в изнач. позиции/гнездо ожидания 2го магазина вверх"
  },
  {
    "code": "М233",
    "name": "Гнездо ожидания вниз/магазин в сменной позиции/гнездо ожидания 2го магазина вниз"
  },
  {
    "code": "М236",
    "name": "Индексация следующего инструмента (безманипуляторная)"
  },
  {
    "code": "М237",
    "name": "Вкл. оттормаживание двигателем устр. авт. смены инстр."
  },
  {
    "code": "М238",
    "name": "Выкл. оттормаживание двигателем устр. авт. смены инстр."
  },
  {
    "code": "М239",
    "name": "Вкл. режим обслуживания устр. авт. смены инстр./детали"
  },
  {
    "code": "М240",
    "name": "Выкл. режим обслуживания устр. авт. смены"
  },
  {
    "code": "М241",
    "name": "Цикл 1 руки ATC"
  },
  {
    "code": "М291",
    "name": "Внешняя команда M291"
  },
  {
    "code": "М292",
    "name": "Внешняя команда M292"
  },
  {
    "code": "М293",
    "name": "Внешняя команда M293"
  },
  {
    "code": "М294",
    "name": "Внешняя команда M294"
  },
  {
    "code": "М295",
    "name": "Внешняя команда M295"
  },
  {
    "code": "М313",
    "name": "Активация подачи СОЖ через шпиндель"
  },
  {
    "code": "М314",
    "name": "Деактивация подачи СОЖ через шпиндель"
  }
];