var FANUC_TURNING_M =[
  {
    "code": "М00",
    "name": "Программный технологический останов"
  },
  {
    "code": "М01",
    "name": "Технологический останов с подтверждением"
  },
  {
    "code": "М02",
    "name": "Конец программы"
  },
  {
    "code": "М03",
    "name": "Вращение шпинделя по часовой стрелке"
  },
  {
    "code": "М04",
    "name": "Вращение шпинделя против часовой стрелки"
  },
  {
    "code": "М05",
    "name": "Стоп вращения шпинделя"
  },
  {
    "code": "М07",
    "name": "Включение СОЖ через шпиндель"
  },
  {
    "code": "М08",
    "name": "Включение СОЖ"
  },
  {
    "code": "М09",
    "name": "Выключение СОЖ"
  },
  {
    "code": "М10",
    "name": "Подвод ловителя деталей"
  },
  {
    "code": "М11",
    "name": "Отвод ловителя деталей"
  },
  {
    "code": "М14",
    "name": "Включение обдува главного шпинделя"
  },
  {
    "code": "М15",
    "name": "Выключение обдува"
  },
  {
    "code": "М17",
    "name": "Включение блокировки станка"
  },
  {
    "code": "М18",
    "name": "Отмена блокировки станка"
  },
  {
    "code": "М19",
    "name": "Ориентация главного шпинделя"
  },
  {
    "code": "М20",
    "name": "Загрузчик инструмента"
  },
  {
    "code": "М21",
    "name": "Включение пропуска кадра с подтверждением"
  },
  {
    "code": "М22",
    "name": "Отмена пропуска кадры с подтверждением"
  },
  {
    "code": "М24",
    "name": "Включение транспортера"
  },
  {
    "code": "М25",
    "name": "Выключение транспортера"
  },
  {
    "code": "М26",
    "name": "Подвод гидравлического инструмента"
  },
  {
    "code": "М27",
    "name": "Отвод гидравлического инструмента"
  },
  {
    "code": "М29",
    "name": "Включение жесткого резьбонарезания метчиком"
  },
  {
    "code": "М30",
    "name": "Конец программы с переходом в начало"
  },
  {
    "code": "М31",
    "name": "Отмена блокировки передвижений при разжатом патроне"
  },
  {
    "code": "М33",
    "name": "Вращение приводного инструмента по часовой стрелке"
  },
  {
    "code": "М34",
    "name": "Вращение приводного инструмента против часовой стрелки"
  },
  {
    "code": "М35",
    "name": "Стоп вращения приводного инструмента"
  },
  {
    "code": "М36",
    "name": "Отключение зацепления автоматического люнета/Подвод давления"
  },
  {
    "code": "М37",
    "name": "Включение зацепления автоматического люнета/Отвод давления"
  },
  {
    "code": "М38",
    "name": "Включение зацепления люнета 2 (правый)"
  },
  {
    "code": "М39",
    "name": "Отключение зацепления люнета 2 (правый)"
  },
  {
    "code": "М40",
    "name": "Смена диапазона 0"
  },
  {
    "code": "М41",
    "name": "Смена диапазона 1"
  },
  {
    "code": "М42",
    "name": "Смена диапазона 2"
  },
  {
    "code": "М43",
    "name": "Смена диапазона 3"
  },
  {
    "code": "М46",
    "name": "Отжим тела детали & Подвод давления"
  },
  {
    "code": "М47",
    "name": "Зажим тела детали & Отвод давления"
  },
  {
    "code": "М50",
    "name": "Подача прутка, команда 1"
  },
  {
    "code": "М51",
    "name": "Подача прутка, команда 2"
  },
  {
    "code": "М52",
    "name": "Открытие ограждения"
  },
  {
    "code": "М53",
    "name": "Закрытие ограждения"
  },
  {
    "code": "М54",
    "name": "Счетчик деталей"
  },
  {
    "code": "М56",
    "name": "Включение цикла нарезания резьбы"
  },
  {
    "code": "М57",
    "name": "Отключение цикла нарезания резьбы"
  },
  {
    "code": "М58",
    "name": "Включение зацепления люнета 1 (левый)"
  },
  {
    "code": "М59",
    "name": "Отключение зацепления люнета 1 (левый)"
  },
  {
    "code": "М60",
    "name": "Смена инструмента с передвижением осей"
  },
  {
    "code": "М61",
    "name": "Переключение низкой скорости"
  },
  {
    "code": "М62",
    "name": "Переключение высокой скорости"
  },
  {
    "code": "М63",
    "name": "Вращение главного шпинделя по часовой стрелке и включение СОЖ"
  },
  {
    "code": "М64",
    "name": "Вращение главного шпинделя против часовой и включение СОЖ"
  },
  {
    "code": "М65",
    "name": "Стоп главного привода и отключение СОЖ"
  },
  {
    "code": "М66",
    "name": "Слабый зажим второго патрона"
  },
  {
    "code": "М67",
    "name": "Сильный зажим второго патрона"
  },
  {
    "code": "М68",
    "name": "Зажим главного патрона"
  },
  {
    "code": "М69",
    "name": "Отжим главного патрона"
  },
  {
    "code": "М70",
    "name": "Медленный подвод второй задней бабки"
  },
  {
    "code": "М72",
    "name": "Инструкция приводного инструмента – перемещения"
  },
  {
    "code": "М73",
    "name": "Инструкция приводного инструмента – обычное состояние"
  },
  {
    "code": "М74",
    "name": "Включение определения ошибки"
  },
  {
    "code": "М75",
    "name": "Отключение определения ошибки"
  },
  {
    "code": "М76",
    "name": "Включение фрезерования"
  },
  {
    "code": "М77",
    "name": "Отключение фрезерования"
  },
  {
    "code": "М78",
    "name": "Подвод пиноли задней бабки"
  },
  {
    "code": "М79",
    "name": "Отвод пиноли задней бабки"
  },
  {
    "code": "М80",
    "name": "Подвод механизма привязки инструмента"
  },
  {
    "code": "М81",
    "name": "Отвод механизма привязки инструмента"
  },
  {
    "code": "М84",
    "name": "Поворот револьверной головки по часовой стрелке"
  },
  {
    "code": "М85",
    "name": "Поворот револьверной головки против часовой стрелки"
  },
  {
    "code": "М86",
    "name": "Включение пропуска поворота"
  },
  {
    "code": "М87",
    "name": "Отключение пропуск поворота"
  },
  {
    "code": "М88",
    "name": "Слабый зажим главного шпинделя"
  },
  {
    "code": "М89",
    "name": "Сильный зажим главного шпинделя"
  },
  {
    "code": "М90",
    "name": "Разжим главного шпинделя"
  },
  {
    "code": "М91",
    "name": "Внешняя команда М91"
  },
  {
    "code": "М92",
    "name": "Внешняя команда М92"
  },
  {
    "code": "М93",
    "name": "Внешняя команда М93"
  },
  {
    "code": "М94",
    "name": "Внешняя команда М94"
  },
  {
    "code": "М98",
    "name": "Запрос подпрограммы"
  },
  {
    "code": "М99",
    "name": "Конец подпрограммы"
  },
  {
    "code": "М103",
    "name": "Вращение противошпинделя по часовой стрелке"
  },
  {
    "code": "М104",
    "name": "Вращение противошпинделя против часовой стрелки"
  },
  {
    "code": "М105",
    "name": "Стоп вращения противошпинделя"
  },
  {
    "code": "М108",
    "name": "Включение СОЖ для противошпинделя"
  },
  {
    "code": "М109",
    "name": "Выключение СОЖ для противошпинделя"
  },
  {
    "code": "М114",
    "name": "Обдув для противошпинделя"
  },
  {
    "code": "М116",
    "name": "Включение выталкивателя деталей"
  },
  {
    "code": "М119",
    "name": "Ориентация противошпинделя"
  },
  {
    "code": "М120",
    "name": "Включение системы подтверждения резания"
  },
  {
    "code": "М125",
    "name": "Обработка длинной заготовки"
  },
  {
    "code": "М131",
    "name": "Блокировка перемещений (противошпиндель)"
  },
  {
    "code": "М140",
    "name": "Пуск первой программы для оси В"
  },
  {
    "code": "М141",
    "name": "Пуск второй программы для оси В"
  },
  {
    "code": "М142",
    "name": "Пуск третьей программы для оси В"
  },
  {
    "code": "M152",
    "name": "Ориентация приводного шпинделя"
  },
  {
    "code": "М163",
    "name": "Вращение противошпинделя по часовой стрелке и включение СОЖ"
  },
  {
    "code": "М164",
    "name": "Вращение противошпинделя против часовой и включение СОЖ"
  },
  {
    "code": "М165",
    "name": "Стоп вращение противошпинделя и СОЖ"
  },
  {
    "code": "М166",
    "name": "Слабый зажим патрона (SUB)"
  },
  {
    "code": "M167",
    "name": "Сильный зажим патрона (SUB)"
  },
  {
    "code": "M168",
    "name": "Зажим SUB-патрона"
  },
  {
    "code": "М169",
    "name": "Разжим SUB-патрона"
  },
  {
    "code": "M180",
    "name": "Револьверная голова – вращение ПО ЧС"
  },
  {
    "code": "M181",
    "name": "Револьверная голова – вращение ПРОТИВ ЧС"
  },
  {
    "code": "М189",
    "name": "Зажим противошпинделя"
  },
  {
    "code": "М190",
    "name": "Ожидание контроля оси В"
  },
  {
    "code": "М203",
    "name": "Синхронизирующая команда вперед"
  },
  {
    "code": "М204",
    "name": "Синхронизирующая команда назад"
  },
  {
    "code": "М205",
    "name": "Стоп синхронизации"
  },
  {
    "code": "М206",
    "name": "Смена направления вращения шпинделя"
  }
];