var HAAS_TURNING_M = [
  {
    "title": "M00",
    "description": "Остановка программы"
  },
  {
    "title": "M01",
    "description": "Остановка программы"
  },
  {
    "title": "M02",
    "description": "Конец программы"
  },
  {
    "title": "M03",
    "description": "Шпиндель включен, вперед"
  },
  {
    "title": "M04",
    "description": "Шпиндель включен, реверс"
  },
  {
    "title": "M05",
    "description": "Остановка шпинделя"
  },
  {
    "title": "M08",
    "description": "Включение СОЖ"
  },
  {
    "title": "M09",
    "description": "Выключить СОЖ"
  },
  {
    "title": "M10",
    "description": "Зажим патрона"
  },
  {
    "title": "M11",
    "description": "Патрон разжат"
  },
  {
    "title": "M12",
    "description": "Автоматический обдув струей сжатого воздуха вкл. (Опция)"
  },
  {
    "title": "M13",
    "description": "Автоматический обдув струей сжатого воздуха выкл. (Опция)"
  },
  {
    "title": "M14",
    "description": "Тормоз основного шпинделя вкл (Опция оси C)"
  },
  {
    "title": "M15",
    "description": "Тормоз основного шпинделя выкл (Опция оси C)"
  },
  {
    "title": "M17",
    "description": "Вращение револьверной головки вперед"
  },
  {
    "title": "M18",
    "description": "Вращение револьверной головки назад"
  },
  {
    "title": "M19",
    "description": "Ориентация шпинделя (опция)"
  },
  {
    "title": "M21",
    "description": "Подвод задней бабки (Опция)"
  },
  {
    "title": "M22",
    "description": "Отвод задней бабки (Опция)"
  },
  {
    "title": "M23",
    "description": "Фаска выхода из резьбы вкл"
  },
  {
    "title": "M24",
    "description": "Фаска выхода из резьбы выкл"
  },
  {
    "title": "M30",
    "description": "Конец программы и сброс"
  },
  {
    "title": "M31",
    "description": "Шнековый транспортер удаления стружки вперед (Опция)"
  },
  {
    "title": "M33",
    "description": "Шнековый транспортер удаления стружки стоп (Опция)"
  },
  {
    "title": "M36",
    "description": "Ловушка деталей вкл (Опция)"
  },
  {
    "title": "M37",
    "description": "Ловушка деталей выкл (Опция)"
  },
  {
    "title": "M38",
    "description": "Изменение скорости вращения шпинделя вкл"
  },
  {
    "title": "M39",
    "description": "Изменение скорости вращения шпинделя выкл"
  },
  {
    "title": "M41",
    "description": "Низшая передача (Опция)"
  },
  {
    "title": "M42",
    "description": "Высшая передача (Опция)"
  },
  {
    "title": "M43",
    "description": "Разжим револьверной головки (только для технического обслуживания)"
  },
  {
    "title": "M44",
    "description": "Зажим револьверной головки (только для технического обслуживания)"
  },
  {
    "title": "M51",
    "description": "Пользовательские M-коды, включить (опция)"
  },
  {
    "title": "M52",
    "description": "Пользовательские M-коды, включить (опция)"
  },
  {
    "title": "M53",
    "description": "Пользовательские M-коды, включить (опция)"
  },
  {
    "title": "M54",
    "description": "Пользовательские M-коды, включить (опция)"
  },
  {
    "title": "M55",
    "description": "Пользовательские M-коды, включить (опция)"
  },
  {
    "title": "M56",
    "description": "Пользовательские M-коды, включить (опция)"
  },
  {
    "title": "M57",
    "description": "Пользовательские M-коды, включить (опция)"
  },
  {
    "title": "M58",
    "description": "Пользовательские M-коды, включить (опция)"
  },
  {
    "title": "M59",
    "description": "Задать выходное реле"
  },
  {
    "title": "M61",
    "description": "Пользовательские M-коды, выключить (опция)"
  },
  {
    "title": "M62",
    "description": "Пользовательские M-коды, выключить (опция)"
  },
  {
    "title": "M63",
    "description": "Пользовательские M-коды, выключить (опция)"
  },
  {
    "title": "M64",
    "description": "Пользовательские M-коды, выключить (опция)"
  },
  {
    "title": "M65",
    "description": "Пользовательские M-коды, выключить (опция)"
  },
  {
    "title": "M66",
    "description": "Пользовательские M-коды, выключить (опция)"
  },
  {
    "title": "M67",
    "description": "Пользовательские M-коды, выключить (опция)"
  },
  {
    "title": "M68",
    "description": "Пользовательские M-коды, выключить (опция)"
  },
  {
    "title": "M69",
    "description": "Удалить заданное выходное реле"
  },
  {
    "title": "M76",
    "description": "Выключение дисплея"
  },
  {
    "title": "M77",
    "description": "Включение дисплея"
  },
  {
    "title": "M78",
    "description": "Сигнал об ошибке при обнаружении сигнала пропуска"
  },
  {
    "title": "M79",
    "description": "Сигнал об ошибке, если сигнал пропуска не обнаружен"
  },
  {
    "title": "M85",
    "description": "Автоматическая дверь открыть (Опция)"
  },
  {
    "title": "M86",
    "description": "Автоматическая дверь закрыть (Опция)"
  },
  {
    "title": "M88",
    "description": "СОЖ высокого давления вкл (Опция)"
  },
  {
    "title": "M89",
    "description": "СОЖ высокого давления выкл (Опция)"
  },
  {
    "title": "M95",
    "description": "Спящий режим"
  },
  {
    "title": "M96",
    "description": "Переход при отсутствии сигнала"
  },
  {
    "title": "M97",
    "description": "Вызов локальной подпрограммы"
  },
  {
    "title": "M98",
    "description": "Вызов подпрограммы"
  },
  {
    "title": "M99",
    "description": "Возврат из подпрограммы или цикла"
  },
  {
    "title": "M104",
    "description": "Рычаг измерительной головки выдвижение (Опция)"
  },
  {
    "title": "M105",
    "description": "Рычаг измерительной головки отвод (Опция)"
  },
  {
    "title": "M109",
    "description": "Диалоговый ввод данных пользователя"
  },
  {
    "title": "M110",
    "description": "Патрон противошпинделя зажим (Опция)"
  },
  {
    "title": "M111",
    "description": "Патрон противошпинделя разжим (Опция)"
  },
  {
    "title": "M112",
    "description": "Противошпиндель обдув струей сжатого воздуха вкл (Опция)"
  },
  {
    "title": "M113",
    "description": "Противошпиндель обдув струей сжатого воздуха выкл (Опция)"
  },
  {
    "title": "M114",
    "description": "Тормоз противошпинделя вкл (Опция)"
  },
  {
    "title": "M115",
    "description": "Тормоз противошпинделя выкл (Опция)"
  },
  {
    "title": "M119",
    "description": "Ориентация противошпинделя (опция)"
  },
  {
    "title": "M121",
    "description": "Пользовательские M-коды (опция)"
  },
  {
    "title": "M122",
    "description": "Пользовательские M-коды (опция)"
  },
  {
    "title": "M123",
    "description": "Пользовательские M-коды (опция)"
  },
  {
    "title": "M124",
    "description": "Пользовательские M-коды (опция)"
  },
  {
    "title": "M125",
    "description": "Пользовательские M-коды (опция)"
  },
  {
    "title": "M126",
    "description": "Пользовательские M-коды (опция)"
  },
  {
    "title": "M127",
    "description": "Пользовательские M-коды (опция)"
  },
  {
    "title": "M128",
    "description": "Пользовательские M-коды (опция)"
  },
  {
    "title": "M133",
    "description": "Приводной инструмент вперед (Опция)"
  },
  {
    "title": "M134",
    "description": "Приводной инструмент назад (Опция)"
  },
  {
    "title": "M135",
    "description": "Приводной инструмент останов (Опция)"
  },
  {
    "title": "M143",
    "description": "Противошпиндель вперед (Опция)"
  },
  {
    "title": "M144",
    "description": "Противошпиндель назад (Опция)"
  },
  {
    "title": "M145",
    "description": "Противошпиндель останов (Опция)"
  },
  {
    "title": "M154",
    "description": "Ось C вкл (Опция)"
  },
  {
    "title": "M155",
    "description": "Ось C выкл (Опция)"
  }
];