var HAAS_TURNING_G = [
  {
    "title": "G00",
    "description": "Позиционирование с ускоренным перемещением"
  },
  {
    "title": "G01",
    "description": "Перемещение с линейной интерполяцией"
  },
  {
    "title": "G02",
    "description": "Перемещение с круговой интерполяцией"
  },
  {
    "title": "G03",
    "description": "Перемещение с круговой интерполяцией"
  },
  {
    "title": "G04",
    "description": "Задержка"
  },
  {
    "title": "G09",
    "description": "Точный останов"
  },
  {
    "title": "G10",
    "description": "Задать коррекции"
  },
  {
    "title": "G14",
    "description": "Перестановка противошпинделя"
  },
  {
    "title": "G15",
    "description": "Отмена противошпинделя"
  },
  {
    "title": "G17",
    "description": "Плоскость XY"
  },
  {
    "title": "G18",
    "description": "Плоскость XZ"
  },
  {
    "title": "G19",
    "description": "Плоскость YZ"
  },
  {
    "title": "G20",
    "description": "Выбор дюймов"
  },
  {
    "title": "G21",
    "description": "Выбор метрических"
  },
  {
    "title": "G28",
    "description": "Возврат в точку начала координат"
  },
  {
    "title": "G29",
    "description": "Возврат из опорной точки"
  },
  {
    "title": "G31",
    "description": "Функция пропуска"
  },
  {
    "title": "G32",
    "description": "Нарезание резьбы"
  },
  {
    "title": "G40",
    "description": "Отмена коррекции вершины инструмента"
  },
  {
    "title": "G41",
    "description": "Коррекция вершины инструмента (КВИ) влево"
  },
  {
    "title": "G42",
    "description": "Коррекция вершины инструмента (КВИ) вправо"
  },
  {
    "title": "G50",
    "description": "Задание коррекции глобальных координат FANUC,YASNAC"
  },
  {
    "title": "G51",
    "description": "Отмена коррекций (YASNAC)"
  },
  {
    "title": "G52",
    "description": "Задать локальную систему координат FANUC"
  },
  {
    "title": "G53",
    "description": "Выбор координат станка"
  },
  {
    "title": "G54",
    "description": "Система координат #1 FANUC"
  },
  {
    "title": "G55",
    "description": "Система координат #2 FANUC"
  },
  {
    "title": "G56",
    "description": "Система координат #3 FANUC"
  },
  {
    "title": "G57",
    "description": "Система координат #4 FANUC"
  },
  {
    "title": "G58",
    "description": "Система координат #5 FANUC"
  },
  {
    "title": "G59",
    "description": "Система координат #6 FANUC"
  },
  {
    "title": "G61",
    "description": "Модальный точный останов"
  },
  {
    "title": "G64",
    "description": "Отмена точного останова G61"
  },
  {
    "title": "G65",
    "description": "Опция вызова макроподпрограммы"
  },
  {
    "title": "G70",
    "description": "Цикл чистовой обработки"
  },
  {
    "title": "G71",
    "description": "Н.Д./В.Д. Цикл снятия припуска"
  },
  {
    "title": "G72",
    "description": "Цикл снятия припуска торцевой поверхности"
  },
  {
    "title": "G73",
    "description": "Цикл снятия припуска по произвольной траектории"
  },
  {
    "title": "G74",
    "description": "Цикл проточки канавок на торце"
  },
  {
    "title": "G75",
    "description": "Н.Д./В.Д. Цикл проточки канавок"
  },
  {
    "title": "G76",
    "description": "Цикл нарезания резьбы, несколько проходов"
  },
  {
    "title": "G80",
    "description": "Отмена стандартного цикла"
  },
  {
    "title": "G81",
    "description": "Стандартный цикл сверления"
  },
  {
    "title": "G82",
    "description": "Стандартный цикл сверления центровочных отверстий"
  },
  {
    "title": "G83",
    "description": "Стандартный цикл обычного сверления с периодическим выводом инструмента"
  },
  {
    "title": "G84",
    "description": "Стандартный цикл нарезания резьбы метчиком"
  },
  {
    "title": "G85",
    "description": "Стандартный цикл растачивания"
  },
  {
    "title": "G86",
    "description": "Стандартный цикл растачивания с остановом"
  },
  {
    "title": "G87",
    "description": "Стандартный цикл растачивания с ручным выводом"
  },
  {
    "title": "G88",
    "description": "Стандартный цикл растачивания с задержкой и ручным выводом"
  },
  {
    "title": "G89",
    "description": "Стандартный цикл растачивания с задержкой"
  },
  {
    "title": "G90",
    "description": "Н.Д./В.Д. Цикл обтачивания"
  },
  {
    "title": "G92",
    "description": "Цикл нарезания резьбы"
  },
  {
    "title": "G94",
    "description": "Цикл подрезки торца"
  },
  {
    "title": "G95",
    "description": "Жесткое нарезание резьбы приводным инструментом (торец)"
  },
  {
    "title": "G96",
    "description": "Постоянная скорость резания включена"
  },
  {
    "title": "G97",
    "description": "Постоянная скорость резания выключена"
  },
  {
    "title": "G98",
    "description": "Подача в минуту"
  },
  {
    "title": "G99",
    "description": "Подача на оборот"
  },
  {
    "title": "G100",
    "description": "Выключить зеркальное отражение"
  },
  {
    "title": "G101",
    "description": "Включение зеркального отражения"
  },
  {
    "title": "G102",
    "description": "Программируемый вывод на RS-232"
  },
  {
    "title": "G103",
    "description": "Ограничить опережающий просмотр блоков"
  },
  {
    "title": "G105",
    "description": "Команда УПП Servo Bar"
  },
  {
    "title": "G110",
    "description": "Система координат #7"
  },
  {
    "title": "G111",
    "description": "Система координат #8"
  },
  {
    "title": "G112",
    "description": "Интерпретация XY в XC"
  },
  {
    "title": "G113",
    "description": "Отмена G112"
  },
  {
    "title": "G114",
    "description": "Система координат #9"
  },
  {
    "title": "G115",
    "description": "Система координат #10"
  },
  {
    "title": "G116",
    "description": "Система координат #11"
  },
  {
    "title": "G117",
    "description": "Система координат #12"
  },
  {
    "title": "G118",
    "description": "Система координат #13"
  },
  {
    "title": "G119",
    "description": "Система координат #14"
  },
  {
    "title": "G120",
    "description": "Система координат #15"
  },
  {
    "title": "G121",
    "description": "Система координат #16"
  },
  {
    "title": "G122",
    "description": "Система координат #17"
  },
  {
    "title": "G123",
    "description": "Система координат #18"
  },
  {
    "title": "G124",
    "description": "Система координат #19"
  },
  {
    "title": "G125",
    "description": "Система координат #20"
  },
  {
    "title": "G126",
    "description": "Система координат #21"
  },
  {
    "title": "G127",
    "description": "Система координат #22"
  },
  {
    "title": "G128",
    "description": "Система координат #23"
  },
  {
    "title": "G129",
    "description": "Система координат #24"
  },
  {
    "title": "G154",
    "description": "Выбор координат детали P1-99"
  },
  {
    "title": "G159",
    "description": "Фоновый подхват / возврат детали"
  },
  {
    "title": "G160",
    "description": "Только командный режим оси АЗД"
  },
  {
    "title": "G161",
    "description": "Командный режим оси АЗД выключен"
  },
  {
    "title": "G184",
    "description": "Стандартный цикл обратного нарезания резьбы метчиком для левой резьбы"
  },
  {
    "title": "G186",
    "description": "Реверс жесткого нарезания резьбы приводным инструментом (для левой резьбы)"
  },
  {
    "title": "G187",
    "description": "Контроль точности"
  },
  {
    "title": "G195",
    "description": "Прямое радиальное нарезание резьбы приводным инструментом (диаметр)"
  },
  {
    "title": "G196",
    "description": "Обратное нарезание резьбы приводным инструментом (диаметр)"
  },
  {
    "title": "G198",
    "description": "Выключить синхронное управление шпинделями"
  },
  {
    "title": "G199",
    "description": "Включить синхронное управление шпинделями"
  },
  {
    "title": "G200",
    "description": "Индексация на ходу"
  },
  {
    "title": "G211",
    "description": "Ручная размерная настройка инструмента"
  },
  {
    "title": "G212",
    "description": "Автоматическая размерная настройка инструмента"
  },
  {
    "title": "G241",
    "description": "Стандартный цикл радиального сверления"
  },
  {
    "title": "G242",
    "description": "Стандартный цикл радиального сверления центровых отверстий"
  },
  {
    "title": "G243",
    "description": "Стандартный цикл радиального обычного сверления с периодическим выводом инструмента"
  },
  {
    "title": "G245",
    "description": "Стандартный цикл радиального растачивания"
  },
  {
    "title": "G246",
    "description": "Стандартный цикл радиального растачивания с остановом"
  },
  {
    "title": "G247",
    "description": "Стандартный цикл радиального растачивания с ручным выводом инструмента"
  },
  {
    "title": "G248",
    "description": "Стандартный цикл радиального растачивания с задержкой и ручным выводом инструмента"
  },
  {
    "title": "G249",
    "description": "Стандартный цикл радиального растачивания с задержкой"
  }
];