var HAAS_MILLING_G = [
  {
    "title": "G00",
    "description": "Позиционирование с ускоренным перемещением"
  },
  {
    "title": "G01",
    "description": "Перемещение с линейной интерполяцией"
  },
  {
    "title": "G02",
    "description": "Перемещение с круговой интерполяцией ЧС"
  },
  {
    "title": "G03",
    "description": "Перемещение с круговой интерполяцией ПЧС"
  },
  {
    "title": "G04",
    "description": "Задержка"
  },
  {
    "title": "G09",
    "description": "Точный останов"
  },
  {
    "title": "G10",
    "description": "Задать коррекции"
  },
  {
    "title": "G12",
    "description": "Фрезерование круглого кармана ЧС"
  },
  {
    "title": "G13",
    "description": "Фрезерование круглого кармана ПЧС"
  },
  {
    "title": "G17",
    "description": "Выбор плоскости XY"
  },
  {
    "title": "G18",
    "description": "Выбор плоскости XZ"
  },
  {
    "title": "G19",
    "description": "Выбор плоскости YZ"
  },
  {
    "title": "G20",
    "description": "Выбор дюймов"
  },
  {
    "title": "G21",
    "description": "Выбор метрических"
  },
  {
    "title": "G28",
    "description": "Возврат в точку начала координат станка"
  },
  {
    "title": "G29",
    "description": "Возврат из опорной точки"
  },
  {
    "title": "G31",
    "description": "Подача до пропуска"
  },
  {
    "title": "G35",
    "description": "Автоматическое измерение диаметра инструмента"
  },
  {
    "title": "G36",
    "description": "Автоматическое измерение коррекции детали"
  },
  {
    "title": "G37",
    "description": "Автоматическое измерение коррекции на инструмент"
  },
  {
    "title": "G40",
    "description": "Отмена коррекции на инструмент"
  },
  {
    "title": "G41",
    "description": "2D коррекция на инструмент влево"
  },
  {
    "title": "G42",
    "description": "2D коррекция на инструмент вправо"
  },
  {
    "title": "G43",
    "description": "Коррекция на длину инструмента + (сложение)"
  },
  {
    "title": "G44",
    "description": "Коррекция на длину инструмента - (вычитание)"
  },
  {
    "title": "G47",
    "description": "Гравирование текста"
  },
  {
    "title": "G49",
    "description": "Отмена G43/G44/G143"
  },
  {
    "title": "G50",
    "description": "Отмена масштабирования"
  },
  {
    "title": "G51",
    "description": "Масштабирование"
  },
  {
    "title": "G52",
    "description": "Задать систему координат детали 00 или"
  },
  {
    "title": "G53",
    "description": "Немодальный выбор координат станка"
  },
  {
    "title": "G54",
    "description": "Выбор системы координат детали #1"
  },
  {
    "title": "G55",
    "description": "Выбор системы координат детали #2"
  },
  {
    "title": "G56",
    "description": "Выбор системы координат детали #3"
  },
  {
    "title": "G57",
    "description": "Выбор системы координат детали #4"
  },
  {
    "title": "G58",
    "description": "Выбор системы координат детали #5"
  },
  {
    "title": "G59",
    "description": "Выбор системы координат детали #6"
  },
  {
    "title": "G60",
    "description": "Однонаправленное позиционирование"
  },
  {
    "title": "G61",
    "description": "Режим точного останова"
  },
  {
    "title": "G64",
    "description": "G61 Отмена"
  },
  {
    "title": "G65",
    "description": "Опция вызова макроподпрограммы"
  },
  {
    "title": "G68",
    "description": "Вращение"
  },
  {
    "title": "G69",
    "description": "Отмена вращения G68"
  },
  {
    "title": "G70",
    "description": "Окружность отверстия под болт"
  },
  {
    "title": "G71",
    "description": "Дуга болтовых отверстий"
  },
  {
    "title": "G72",
    "description": "Угол из болтовых отверстий"
  },
  {
    "title": "G73",
    "description": "Стандартный цикл высокоскоростного сверления спериодическим выводом инструмента"
  },
  {
    "title": "G74",
    "description": "Стандартный цикл реверсивного нарезания резьбы"
  },
  {
    "title": "G76",
    "description": "Стандартный цикл чистового растачивания"
  },
  {
    "title": "G77",
    "description": "Стандартный цикл обратного растачивания"
  },
  {
    "title": "G80",
    "description": "Отмена стандартного цикла"
  },
  {
    "title": "G81",
    "description": "Стандартный цикл сверления"
  },
  {
    "title": "G82",
    "description": "Стандартный цикл сверления центровочных отверстий"
  },
  {
    "title": "G83",
    "description": "Стандартный цикл обычного сверления с периодическим выводом инструмента"
  },
  {
    "title": "G84",
    "description": "Стандартный цикл нарезания резьбы метчиком"
  },
  {
    "title": "G85",
    "description": "Стандартный цикл растачивания"
  },
  {
    "title": "G86",
    "description": "Стандартный цикл растачивания с остановом"
  },
  {
    "title": "G89",
    "description": "Стандартный цикл прямого растачивания, задержки,обратного растачивания"
  },
  {
    "title": "G90",
    "description": "Команда абсолютного позиционирования"
  },
  {
    "title": "G91",
    "description": "Команда относительного позиционирования"
  },
  {
    "title": "G92",
    "description": "Задание значения смещения системы координат детали"
  },
  {
    "title": "G93",
    "description": "Режим обратнозависимой подачи"
  },
  {
    "title": "G94",
    "description": "Режим подачи в минуту"
  },
  {
    "title": "G95",
    "description": "Подача на оборот"
  },
  {
    "title": "G98",
    "description": "Стандартный цикл возврата в исходную точку"
  },
  {
    "title": "G99",
    "description": "Стандартный цикл возврата в плоскость R"
  },
  {
    "title": "G100",
    "description": "Отмена зеркального отражения"
  },
  {
    "title": "G101",
    "description": "Включение зеркального отражения"
  },
  {
    "title": "G103",
    "description": "Ограничение буферизации блоков"
  },
  {
    "title": "G107",
    "description": "Цилиндрическое отображение"
  },
  {
    "title": "G110",
    "description": "#7 Система координат"
  },
  {
    "title": "G111",
    "description": "#8 Система координат"
  },
  {
    "title": "G112",
    "description": "#9 Система координат"
  },
  {
    "title": "G113",
    "description": "#10 Система координат"
  },
  {
    "title": "G114",
    "description": "#11 Система координат"
  },
  {
    "title": "G115",
    "description": "#12 Система координат"
  },
  {
    "title": "G116",
    "description": "#13 Система координат"
  },
  {
    "title": "G117",
    "description": "#14 Система координат"
  },
  {
    "title": "G118",
    "description": "#15 Система координат"
  },
  {
    "title": "G119",
    "description": "#16 Система координат"
  },
  {
    "title": "G120",
    "description": "#17 Система координат"
  },
  {
    "title": "G121",
    "description": "#18 Система координат"
  },
  {
    "title": "G122",
    "description": "#19 Система координат"
  },
  {
    "title": "G123",
    "description": "#20 Система координат"
  },
  {
    "title": "G124",
    "description": "#21 Система координат"
  },
  {
    "title": "G125",
    "description": "#22 Система координат"
  },
  {
    "title": "G126",
    "description": "#23 Система координат"
  },
  {
    "title": "G127",
    "description": "#24 Система координат"
  },
  {
    "title": "G128",
    "description": "#25 Система координат"
  },
  {
    "title": "G129",
    "description": "#26 Система координат"
  },
  {
    "title": "G136",
    "description": "Автоматическое измерение центра коррекции детали"
  },
  {
    "title": "G141",
    "description": "Коррекция на инструмент 3D+"
  },
  {
    "title": "G143",
    "description": "Коррекция на длину инструмента с 5 осями"
  },
  {
    "title": "G150",
    "description": "Универсальный цикл фрезерования кармана"
  },
  {
    "title": "G153",
    "description": "Стандартный цикл высокоскоростного сверления с периодическим выводом инструмента с использованием 5-й оси"
  },
  {
    "title": "G154",
    "description": "Выбор координат детали P1-P99"
  },
  {
    "title": "G155",
    "description": "Стандартный цикл реверсивного нарезания резьбы с использованием 5-й оси"
  },
  {
    "title": "G161",
    "description": "Стандартный цикл сверления с использованием 5-й оси"
  },
  {
    "title": "G162",
    "description": "Стандартный цикл сверления центровочных отверстий с использованием 5-й оси"
  },
  {
    "title": "G163",
    "description": "Стандартный цикл обычного сверления с периодическим выводом инструмента с использованием 5-й оси"
  },
  {
    "title": "G164",
    "description": "Стандартный цикл нарезания резьбы с использованием 5-й оси"
  },
  {
    "title": "G165",
    "description": "Стандартный цикл растачивания с использованием 5-й оси"
  },
  {
    "title": "G166",
    "description": "Стандартный цикл растачивания с остановом с использованием 5-й оси"
  },
  {
    "title": "G169",
    "description": "Стандартный цикл растачивания с задержкой с использованием 5-й оси"
  },
  {
    "title": "G174",
    "description": "Невертикальное жесткое нарезание резьбы ПЧС"
  },
  {
    "title": "G184",
    "description": "Невертикальное жесткое нарезание резьбы ЧС"
  },
  {
    "title": "G187",
    "description": "Настройка уровня плавности"
  },
  {
    "title": "G188",
    "description": "Получение программы из ТЦС"
  },
  {
    "title": "G234",
    "description": "Система управления вершиной инструмента (СУВИ) (UMC)"
  },
  {
    "title": "G254",
    "description": "Динамическая коррекция детали (ДКД) (UMC)"
  },
  {
    "title": "G255",
    "description": "Отмена динамической коррекции детали (ДКД) (UMC)"
  }
]